&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого стр Из Параметры.Игры Цикл
		ЗаполнитьЗначенияСвойств(Игры.Добавить(), стр)
	КонецЦикла;
	
	НоваяДата = Параметры.НоваяДата
	
КонецПроцедуры

&НаКлиенте
Процедура Плюс25(Команда)
	
	Если Не БылоНажатие И Не ИзмениласьДата Тогда 
		
		//ИсходнаяДата = Игры[Игры.Количество()-1].Дата;
		ИсходнаяДата = Дата(1,1,1);
		Нашли = Ложь;
		
		// самую позднюю из установленных дат со временем
		Для каждого стр Из Игры Цикл
			Если Не НачалоДня(стр.Дата) = стр.Дата Тогда
				ИсходнаяДата = Макс(ИсходнаяДата, стр.Дата);
				Нашли = Истина;
			КонецЕсли;	
		КонецЦикла;
		
		Если Нашли Тогда 
			НоваяДата = ИсходнаяДата
		Иначе	
			НоваяДата = НоваяДата + 12*60*60;
		КонецЕсли;
		
	ИначеЕсли Не БылоНажатие Тогда	// изменилась дата
		
		НоваяДата = НоваяДата + 12*60*60;
		
		
		
	КонецЕсли;	
	
	БылоНажатие = Истина;
	
	Изменить25(НоваяДата);
	
	
КонецПроцедуры

&НаКлиенте
Процедура Минус25(Команда)
	
	Если Не БылоНажатие Тогда 
		
		Нашли = Ложь;
		
		// самую раннюю из установленных дат со временем, они уже отсортированы по дате
		Для каждого стр Из Игры Цикл
			Если Не НачалоДня(стр.Дата) = стр.Дата Тогда
				ИсходнаяДата = стр.Дата;
				Нашли = Истина;
				Прервать
			КонецЕсли;	
		КонецЦикла;
		Если Нашли Тогда 
			Изменить25(ИсходнаяДата, 1);
		Иначе
			ИсходнаяДата = НоваяДата + 12*60*60;
		КонецЕсли;
		БылоНажатие = Истина
		
	Иначе
		Изменить25(НоваяДата, 1);
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Изменить25(ИсходнаяДата, Направление = 0)
	
	Если НачалоДня(ИсходнаяДата) = ИсходнаяДата Тогда
		НоваяДата = ИсходнаяДата + 12*60*60
	Иначе	
		НоваяДата = ИсходнаяДата + ?(Направление=0, 1, -1)*5*60*60/2
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура Плюс10(Команда)
	Если НачалоДня(НоваяДата) = НоваяДата Тогда
		НоваяДата = НоваяДата + 12*60*60
	Иначе	
		НоваяДата = НоваяДата + 60*60
	КонецЕсли;
	БылоНажатие = Истина
КонецПроцедуры

&НаКлиенте
Процедура Минус10(Команда)
	Если НачалоДня(НоваяДата) = НоваяДата Тогда
		НоваяДата = НоваяДата + 12*60*60
	Иначе	
		НоваяДата = НоваяДата - 60*60
	КонецЕсли;
	БылоНажатие = Истина
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	//ЭтаФорма.ВладелецФормы.НоваяДата = НоваяДата;
	Закрыть(НоваяДата);
	//Оповестить("ИзмененаДатаИгры");
	
КонецПроцедуры

&НаКлиенте
Процедура МинусСутки(Команда)
	НоваяДата = НоваяДата - 24*60*60;
	ИзмениласьДата = Истина
КонецПроцедуры

&НаКлиенте
Процедура ПлюсСутки(Команда)
	НоваяДата = НоваяДата + 24*60*60;
	ИзмениласьДата = Истина
КонецПроцедуры
