
Процедура Отчет(ТабДок, Сезон, Страна) Экспорт
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Макет = ПолучитьМакет("Отчет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИгрыОб.Тур КАК Тур,
	|	ИгрыОб.ВОборот + ИгрыОб.НОборот + ИгрыОб.ПОборот КАК ИгрСыграно,
	|	СУММА(ИгрыОб.ВОборот) КАК Хозяева,
	|	СУММА(ИгрыОб.НОборот) КАК Ничьи,
	|	СУММА(ИгрыОб.ПОборот) КАК Гости,
	|	ИгрыОб.МЗОборот + ИгрыОб.МПОборот КАК ВсегоМячи,
	|	СУММА(ИгрыОб.МЗОборот) КАК ХозяеваМячи,
	|	СУММА(ИгрыОб.МПОборот) КАК ГостиМячи,
	|	ИгрыОб.МЗОборот - ИгрыОб.МПОборот КАК Разница,
	|	(ИгрыОб.МЗОборот + ИгрыОб.МПОборот) / (ИгрыОб.ВОборот + ИгрыОб.НОборот + ИгрыОб.ПОборот) КАК СреднРезультативность
	|ИЗ
	|	РегистрНакопления.Игры.Обороты(
	|			,
	|			,
	|			,
	|			Сезон = &Сезон
	|				И Страна = &Страна
	|				И ГдеИгра = 1) КАК ИгрыОб
	|
	|СГРУППИРОВАТЬ ПО
	|	ИгрыОб.Тур,
	|	ИгрыОб.МЗОборот - ИгрыОб.МПОборот,
	|	ИгрыОб.МЗОборот + ИгрыОб.МПОборот,
	|	(ИгрыОб.МЗОборот + ИгрыОб.МПОборот) / (ИгрыОб.ВОборот + ИгрыОб.НОборот + ИгрыОб.ПОборот),
	|	ИгрыОб.ВОборот + ИгрыОб.НОборот + ИгрыОб.ПОборот
	|
	|УПОРЯДОЧИТЬ ПО
	|	Тур
	|ИТОГИ
	|	КОЛИЧЕСТВО(Тур),
	|	СУММА(ИгрСыграно),
	|	СУММА(Хозяева),
	|	СУММА(Ничьи),
	|	СУММА(Гости),
	|	СУММА(ВсегоМячи),
	|	СУММА(ХозяеваМячи),
	|	СУММА(ГостиМячи),
	|	СУММА(Разница),
	|	СУММА(СреднРезультативность)
	|ПО
	|	ОБЩИЕ";

	Запрос.УстановитьПараметр("Сезон", Сезон);
	Запрос.УстановитьПараметр("Страна", Страна);

	Результат = Запрос.Выполнить();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаОбщийИтог	= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    ОбластьСрРезИтог	= ОбластьОбщийИтог.Область("СрРезИтог");
	ОбластьСрРез		= ОбластьДетальныхЗаписей.Область("СрРез");
	ЦветУр1	= WebЦвета.ОранжевоКрасный;
	ЦветУр2	= WebЦвета.Золотой;
	ЦветУр3	= WebЦвета.ЗеленоЖелтый;
	ЦветУр4	= WebЦвета.Аквамарин;
	
	Если ВыборкаОбщийИтог.Следующий() Тогда		// Общий итог
		ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
		ОбластьОбщийИтог.Параметры.СреднРезультативность = ВыборкаОбщийИтог.ВсегоМячи / ВыборкаОбщийИтог.ИгрСыграно;
		ТабДок.Вывести(ОбластьОбщийИтог, ВыборкаОбщийИтог.Уровень());
	КонецЕсли;
	
	ВыборкаДетали = ВыборкаОбщийИтог.Выбрать();

	Пока ВыборкаДетали.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
		Разница = ВыборкаДетали.Разница;
		СрРез	= ВыборкаДетали.СреднРезультативность;
		ОбластьДетальныхЗаписей.Параметры.Разница = ?(Разница > 0, "+", "") + Разница;
		Если СрРез >=3 Тогда
		    ЦветУр = ЦветУр1
		ИначеЕсли СрРез >=2.5 Тогда
		    ЦветУр = ЦветУр2
		ИначеЕсли СрРез >=2 Тогда
		    ЦветУр = ЦветУр3
		Иначе
		    ЦветУр = ЦветУр4
		КонецЕсли;
		ОбластьСрРез.ЦветФона = ЦветУр;
		
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетали.Уровень());
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ
КонецПроцедуры
