
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	стНастройкиЦвета = Константы.хзЦвета.Получить().Получить();
	
	Если Не стНастройкиЦвета = Неопределено И ТипЗнч(стНастройкиЦвета)=Тип("Структура") Тогда
		
		ЦветПобеды		= стНастройкиЦвета.ЦветПобеды;
		ЦветНичьи		= стНастройкиЦвета.ЦветНичьи;
		ЦветПоражения	= стНастройкиЦвета.ЦветПоражения;
		
		ЦветКомандДома	= стНастройкиЦвета.ЦветКомандДома;
		ЦветКомандВыезд	= стНастройкиЦвета.ЦветКомандВыезд;
		
	Иначе
		
		ЦветПобеды		= WebЦвета.ЦветМорскойВолныНейтральный;	//WebЦвета.Красный;
		ЦветНичьи		= WebЦвета.Оранжевый;					//WebЦвета.Зеленый;
		ЦветПоражения	= WebЦвета.Кирпичный;					//WebЦвета.СветлоГрифельноСиний;
		
		ЦветКомандДома	= WebЦвета.Оранжевый;
		ЦветКомандВыезд	= WebЦвета.ЗеленыйЛес;
		
	КонецЕсли;
	
	Элементы.ЦветКомандДома.ЦветТекста	= ЦветКомандДома;
	Элементы.ЦветКомандВыезд.ЦветТекста	= ЦветКомандВыезд;
	Элементы.ЦветПобеды.ЦветФона		= ЦветПобеды;
	Элементы.ЦветНичьи.ЦветФона			= ЦветНичьи;
	Элементы.ЦветПоражения.ЦветФона		= ЦветПоражения;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеВХК(стНастройкиЦвета)
	
	//Сжатие = Новый СжатиеДанных(9); 
	//Хранилище = Новый ХранилищеЗначения(ТЗ,Сжатие);  
	// 
	ХранилищеЗначения	= Новый ХранилищеЗначения(стНастройкиЦвета);
	Константы.хзЦвета.Установить(ХранилищеЗначения);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	стНастройкиЦвета = Новый Структура;
	
	стНастройкиЦвета.Вставить("ЦветПобеды", ЦветПобеды);
	стНастройкиЦвета.Вставить("ЦветНичьи", ЦветНичьи);
	стНастройкиЦвета.Вставить("ЦветПоражения", ЦветПоражения);
	
	стНастройкиЦвета.Вставить("ЦветКомандДома", ЦветКомандДома);
	стНастройкиЦвета.Вставить("ЦветКомандВыезд", ЦветКомандВыезд);
	
	ЗаписатьДанныеВХК(стНастройкиЦвета);
	
	Закрыть()
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	Если Лев(Элемент.Имя, 10) = "ЦветКоманд" Тогда
		Элементы[Элемент.Имя].ЦветТекстаЗаголовка = ЭтаФорма[Элемент.Имя]
	ИначеЕсли Лев(Элемент.Имя, 4) = "Цвет" Тогда
		Элементы[Элемент.Имя].ЦветФона = ЭтаФорма[Элемент.Имя]
	КонецЕсли;	
КонецПроцедуры
