// http://infostart.ru/public/78455/

Перем Дата;

&НаКлиенте
Процедура Сформировать(Команда)
		
	Обновить()
	
КонецПроцедуры

&НаСервере
Процедура Обновить() Экспорт
	
	Макет = Отчеты.ТаблицыКоманд.ПолучитьМакет("Макет");
	
	// для отладки использовать
	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");	// или этот отчет
	Макет = ЭтотОтчет.мВернутьМакет();
	// "обратно" после работы с макетом
	// ЗначениеВРеквизитФормы(Макет, "Отчет");
	// нет необходимости - вывод уже сделан
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	//КоличествоКоманд = обПолучитьКоличествоКомандВСезоне(Сезон);
	//ПоследнийТурСезона = (КоличествоКоманд - 1) * 2;
	

	ТабДок.Очистить();
	ОбластьЗаголовок.Параметры.Заголовок = ?(ДВ=1, "Итоговая таблица", ?(ДВ=2,"дома", "выезд"));
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ТабДок.Рисунки.Очистить();
	нетЦв = Новый Цвет;
	
	// текущие результаты
	тз1 = обПолучитьТекущиеМестаСоперниковКоманды(Команда, ДВ, Сезон1, Сезон2);
	
	счМесто = 1;
	_о = 0; _в=0; _мз=0; _мп=0;
	
	Для каждого стр из Тз1 Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьДетальныхЗаписей.Параметры, стр);
		
		РМ = стр.РазнМячей;
		Если Не РМ = Null Тогда
			РМ = ?(РМ > 0, "+", "") + РМ;
		Иначе 
			РМ = "0"
		КонецЕсли;
		ОбластьДетальныхЗаписей.Параметры.РазнМячей = РМ;
		
		// если показатели одинаковы абсолютно
		Если стр.Очки=_о и стр.Выигр=_в и стр.МЗ=_мз и стр.мп=_мп Тогда
			ОбластьДетальныхЗаписей.Параметры.Место = "";
		Иначе	
			ОбластьДетальныхЗаписей.Параметры.Место = ""+счМесто+".";
		КонецЕсли;	
		_о = стр.Очки; _в=стр.Выигр; _мз=стр.МЗ; _мп=стр.МП;
			
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
		счМесто = счМесто + 1;
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// реквизит отчета
	Сезон2 = Константы.ТекущийСезон.Получить();
	Сезон1 = Сезон2;
	ДВ = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Тур.Дата КАК Дата
	|ИЗ
	|	Документ.Тур КАК Тур
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Дата = Выборка.Дата
	Иначе
		Дата = ТекущаяДата()
	КонецЕсли;
	
	
	// можно с НачПериода по КонПериода, по N-тур с н.г., за 1(2) круг,с N по M туры !!!
	// нужна таблица соответствия туров и дат
	//
	// далее возможна статистика: СЕРИИ КОМАНД и т.п.
	//
	// РЕАЛИЗОВЫВАТЬ !
	
	Обновить()
	
КонецПроцедуры

&НаКлиенте
Процедура ДВПриИзменении(Элемент)
	
	Обновить()
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Команда, Сезон, ДВ, КомандаСоперник", Расшифровка, Сезон2, ДВ, Команда);
	ОткрытьФорму("Отчет.ДанныеПоКоманде.Форма.ФормаОтчета", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	
	Обновить()
	
КонецПроцедуры
