// http://infostart.ru/public/78455/

Перем ОшДо Экспорт, ОшПосле Экспорт;

&НаКлиенте
Процедура Сформировать(Команда)
	Обновить()
КонецПроцедуры

&НаСервере
Процедура Обновить()

	ОшДо = 0; ОшПосле = 0;
	
	ТабДок = Элементы.ПолеТД;
	Отчет(ТабДок, Сезон);
	
	Надпись = "";
	Если ОшДо>0 ИЛИ ОшПосле>0 Тогда
		Надпись =  "Ошибки по дате: "
		+?(ОшДо>0,""+ОшДо+"до","")+?(ОшПосле>0,"/"+ОшПосле+"после","")
	КонецЕсли;	
    НадписьОш = Надпись;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Сезон = Константы.ТекущийСезон.Получить();
	Обновить();
КонецПроцедуры

&НаСервере
Процедура Отчет(ТабДок, Год)

	Макет = Отчеты.Расписание.ПолучитьМакет("Отчет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
    "ВЫБРАТЬ
    |	Игры.Регистратор.Ссылка КАК Документ,
    |	Игры.Регистратор.Номер КАК НомерТура,
    |	Игры.Регистратор.Дата КАК ДатаТура,
    |	Игры.Регистратор.СыграноИгр КАК СыграноИгр,
    |	Игры.Дата КАК Дата,
    |	Игры.Кто КАК Хозяин,
    |	Игры.СКем КАК Гость,
    |	Игры.Счет
    |ИЗ
    |	РегистрНакопления.Игры КАК Игры
    |ГДЕ
    |	Игры.Сезон = &Сезон
    |	И Игры.ГдеИгра = 1
    |
    |УПОРЯДОЧИТЬ ПО
    |	Дата,
    |	Игры.НомерСтроки";
	
	Запрос.УстановитьПараметр("Сезон", Сезон);
	Результат = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	ОбластьНомерТура = Макет.ПолучитьОбласть("НомерТура");
	
	ПолеТД.Очистить();
	ОбластьЗаголовок.Параметры.НаименованиеОтчета = ""+Сезон.Наименование;
	ПолеТД.Вывести(ОбластьЗаголовок);
	ПолеТД.Вывести(ОбластьШапкаТаблицы);
	ПолеТД.ФиксацияСверху = ПолеТД.ВысотаТаблицы;
	ПолеТД.НачатьАвтогруппировкуСтрок();
	
	ВыборкаДетали = Результат.Выбрать();
	НомерТураО = "";
	
	ОблДетали = ОбластьДетальныхЗаписей.Область("СтрокаТур");
	
	ЦветФонаОбычный = Новый Цвет;
	ШрифтОбычный	= Новый Шрифт(,,Ложь);
	ШрифтЖирный		= Новый Шрифт(,,Истина);
	
	ПоследнийЗаполненный = 1;
	
	Пока ВыборкаДетали.Следующий() Цикл
		
		НомерТура = ВыборкаДетали.НомерТура;
		Если НомерТура <> НомерТураО Тогда
			ОбластьНомерТура.Параметры.Заполнить(ВыборкаДетали);
			ОбластьНомерТура.Параметры.НомерТура = СокрЛП(НомерТура)+" й тур";
			
			ПолеТД.Вывести(ОбластьНомерТура, ВыборкаДетали.Уровень());
		КонецЕсли;
		Счет = обЧислоВСчет(ВыборкаДетали.Счет);
		Дата = ВыборкаДетали.Дата;
				
		ОблДетали.ЦветФона	= ЦветФонаОбычный;
		ОблДетали.Шрифт		= ШрифтОбычный;
		
		Если ПустаяСтрока(Счет) И КонецДня(Дата) < КонецДня(ТекущаяДата()) Тогда
			ОшДо = ОшДо + 1;
			ОблДетали.Шрифт = ШрифтЖирный;
			ОблДетали.ЦветФона = WebЦвета.Аквамарин;
		ИначеЕсли ПустаяСтрока(Счет) И КонецДня(Дата) >= КонецДня(ТекущаяДата()) И КонецДня(Дата) <= КонецДня(ТекущаяДата()) + 24*60*60*2 Тогда
			//ОблДетали.Шрифт = ШрифтЖирный;
			ОблДетали.ЦветФона = WebЦвета.ТопленоеМолоко;
		ИначеЕсли НЕ ПустаяСтрока(Счет) И КонецДня(Дата) > КонецДня(ТекущаяДата()) Тогда	
			ОшПосле = ОшПосле + 1;
			ОблДетали.Шрифт = ШрифтЖирный;
			ОблДетали.ЦветФона = WebЦвета.Розовый;
		КонецЕсли;	
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
		ОбластьДетальныхЗаписей.Параметры.Счет = Счет;
		ОбластьДетальныхЗаписей.Параметры.ПараКоманд = 
				"" + ВыборкаДетали.Хозяин+" - "+ВыборкаДетали.Гость;
				
		ПолеТД.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетали.Уровень());
		
		НомерТураО = НомерТура;
		
		//Если ПоследнийЗаполненный = 1 И ВыборкаДетали.ДатаТура > ТекущаяДата() Тогда
		Если ВыборкаДетали.ДатаТура < ТекущаяДата() Тогда
			ПоследнийЗаполненный = НомерТура;
		КонецЕсли; 
		
	КонецЦикла;

	ПолеТД.ЗакончитьАвтогруппировкуСтрок();
	ПолеТД.Вывести(ОбластьПодвалТаблицы);
	ПолеТД.Вывести(ОбластьПодвал);
	
	ПоследнийЗаполненный = обПоследнийСыгранныйТурСезона(Сезон);
	КоличествоТуровВСезоне = обПолучитьКоличествоТуровВСезоне(Сезон);
	ПоследнийЗаполненный = ?(ПоследнийЗаполненный + 3 >= КоличествоТуровВСезоне, КоличествоТуровВСезоне, ПоследнийЗаполненный + 3);
	Попытка
		//ПоследнийЗаполненный = Число(ПоследнийЗаполненный);
		//ПоследнийЗаполненный = ?(ПоследнийЗаполненный + 2 > Число(НомерТура), Число(НомерТура), ПоследнийЗаполненный + 2);
	Исключение
	КонецПопытки;
	Элементы.ПолеТД.ТекущаяОбласть = ПолеТД.НайтиТекст(СокрЛП(""+ПоследнийЗаполненный)+" й тур");

КонецПроцедуры

&НаКлиенте
Процедура ПолеТДОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	// Расшифровка - номер тура
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ", Расшифровка);
	ОткрытьФорму("Документ.Тур.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененТекущийСезон" Тогда
		Сезон = омВызовИзКлиента.обПолучитьТекущийСезон()
	КонецЕсли;
	
	Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СезонПриИзменении(Элемент)
	Обновить();
КонецПроцедуры
