
Функция обПолучитьТекущийСезон() Экспорт
	
	Возврат омВызовСервера.обПолучитьТекущийСезонСервер()
	
КонецФункции // обЧислоВСчет()

Функция обИнфо(Хозяин, Гость, Сыгран = Истина, стрЗаголовок = "") Экспорт
	
	Возврат омВызовСервера.обИнфоСервер(Хозяин, Гость, Сыгран, стрЗаголовок)
	
КонецФункции	// обИнфо Клиент

// для релизов до 8.3.8
Процедура ДействияПередЗавершениемРаботыСистемы(Отказ) Экспорт
	
    Если Не глЗавершитьРаботуСистемы Тогда
        //Если ОбщегоНазначенияСервер.ЗапрашиватьПодтверждениеПриЗавершенииПрограммы() Тогда
	Отказ = Истина;
	ОписаниеОповещения = Новый ОписаниеОповещения("ДействияПередЗавершениемРаботыСистемыЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Завершить работу с программой?", РежимДиалогаВопрос.ДаНет,,,,);
        //КонецЕсли;
    КонецЕсли; 
		
КонецПроцедуры	// ДействияПередЗавершениемСистемы()

Процедура ДействияПередЗавершениемРаботыСистемыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
     
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		//ЗавершитьРаботуСистемы(Истина)	// предложить сохранить модифицированные объекты
		глЗавершитьРаботуСистемы = Истина;
		// в общем модуле ГлобальныйКлиент
		ПодключитьОбработчикОжидания("ЗавершениеРаботыСистемы", 0.1, Истина);
    КонецЕсли; 
     
КонецПроцедуры	// ДействияПередЗавершениемРаботыСистемыЗавершение()

