
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// фильтр на форму по текущему чемпионату
	ЭлементыОтбора = Список.Отбор.Элементы;
	
	ЭлементыОтбора.Очистить();
	ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение		=  Новый ПолеКомпоновкиДанных("Сезон");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= омВызовИзКлиента.обПолучитьТекущийСезон();
	
	//ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	
	ЭлементОтбора.Использование		= Истина;
	
	Элементы.Список.Период = Новый СтандартныйПериод()
	
КонецПроцедуры
