Перем глЗавершитьРаботуСистемы Экспорт;

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	// для релизов до 8.3.8
	//омВызовИзКлиента.ДействияПередЗавершениемРаботыСистемы(Отказ)
	
	// 8.3.8 +
	//#Если ВебКлиент Тогда
		ТекстПредупреждения = "Завершить работу с программой?";
	//#Иначе ТекстПредупреждения = "Для запуска обработки проведения документов нажмите ""Продолжить работу""";
	//	ПодключитьОбработчикОжидания("ОткрытиеОбработки", 0.1, Истина);
	//#КонецЕсли
	//
	Отказ = Истина;
	
КонецПроцедуры

Процедура ОткрытиеОбработки() Экспорт
	ОткрытьФорму("Обработка.ПроведениеДокументов.Форма");
КонецПроцедуры

глЗавершитьРаботуСистемы = Ложь;
