Перем СтрокаСтатуса Экспорт ;

Процедура СправочникСписокПутьОбработкиНачалоВыбора(Элемент, СтандартнаяОбработка) Экспорт 
	
	//ДиалогФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	//ДиалогФайла.ПроверятьСуществованиеФайла = Истина;
	//ДиалогФайла.Каталог = КаталогПрограммы() + "\Отчеты\";
	//ДиалогФайла.Фильтр = "Внешняя обработка(*.epf)|*.epf";
	//ВнешняяОбработка = Неопределено;

	//Если ДиалогФайла.Выбрать() Тогда
	//	Элемент.Значение = ДиалогФайла.ПолноеИмяФайла;
	//КонецЕсли;

КонецПроцедуры

Процедура СтрокаСтатусаФайла(Элемент) Экспорт 
	
	СтрокаСтатуса = "";
	Файл = Новый Файл(Элемент.ТекущаяСтрока.ПутьОбработки);
	Если Не ПустаяСтрока(Файл.Имя) Тогда
		СтрокаСтатуса = "Файл: " + Файл.Имя + Символы.ПС + "размер:" + Файл.Размер()+"; изменен:" + Файл.ПолучитьВремяИзменения() + "; сохранен в ИБ:" + ТекущаяДата();
	КонецЕсли; 
	
КонецПроцедуры

