
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ФорматФайла = "TXT";
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЧтоДелатьПослеВыбора = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если Объект.ФорматФайла = "TXT" Тогда
		Фильтр = "Текстовый документ (*.txt)|*.txt";
	ИначеЕсли Объект.ФорматФайла = "CSV" Тогда
		Фильтр = "CSV-файл (*.csv)|*.csv";
	ИначеЕсли Объект.ФорматФайла = "Excel" Тогда
		Фильтр = "Excel-файл (*.xls;*.xlsx)|*.xls;*.xlsx";		
	ИначеЕсли Объект.ФорматФайла = "DBF" Тогда
		Фильтр = "DBF-файл (*.dbf)|*.dbf";
	ИначеЕсли Объект.ФорматФайла = "XML" Тогда
		Фильтр = "XML-файл (*.xml)|*.xml";
	ИначеЕсли Объект.ФорматФайла = "JSON" Тогда
		Фильтр = "JSON-файл (*.json)|*.json";
	КонецЕсли; 
	
	Проводник.Фильтр = Фильтр;
	Проводник.Показать(ЧтоДелатьПослеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.ПутьКФайлу = ВыбранныеФайлы[0];

КонецПроцедуры // ПослеВыбораФайла()

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	
	Если Объект.ФорматФайла = "TXT" Тогда
		ПрочитатьФайл_TXT();
	ИначеЕсли Объект.ФорматФайла = "CSV" Тогда
		ПрочитатьФайл_CSV();
	ИначеЕсли Объект.ФорматФайла = "Excel" Тогда
		ПрочитатьФайл_XLS();
	ИначеЕсли Объект.ФорматФайла = "DBF" Тогда
		ПрочитатьФайл_DBF();
	ИначеЕсли Объект.ФорматФайла = "XML" Тогда
		ПрочитатьФайл_XML();
	ИначеЕсли Объект.ФорматФайла = "JSON" Тогда
		ПрочитатьФайл_JSON();
	КонецЕсли; 
	
КонецПроцедуры

#Область ПроцедурыЧтенияФайлов   

&НаКлиенте
Процедура ПрочитатьФайл_TXT()  
	
	
	
	
	//Объект.ДанныеФайла1.Очистить();    
	//
	//
	//
	//СпособЧтения = "ЧтениеТекста";//"ТекстовыйДокумент";
	//Если СпособЧтения = "ТекстовыйДокумент" Тогда
	//	
	//	Текст = Новый ТекстовыйДокумент;
	//	Текст.Прочитать(Объект.ПутьКФайлу);
	//	КоличествоСтрок = Текст.КоличествоСтрок();
	//	
	//	Для НомерСтроки=1 По КоличествоСтрок Цикл
	//		
	//		ТекСтрока = Текст.ПолучитьСтроку(НомерСтроки);
	//		ЧастиСтроки = СтрРазделить(ТекСтрока, ";");
	//		
	//		Если ЧастиСтроки.Количество() < 3 Тогда
	//			Сообщение = Новый СообщениеПользователю;
	//			Сообщение.Текст = "В строке № " + НомерСтроки + " неверный формат";
	//			Сообщение.Сообщить();
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		НоваяСтрока = Объект.ДанныеФайла.Добавить();
	//		НоваяСтрока.Наименование = ЧастиСтроки[0];
	//		НоваяСтрока.НаименованиеПолное = ЧастиСтроки[1];
	//		НоваяСтрока.УНП = ЧастиСтроки[2];
	//		
	//	КонецЦикла;
	//	
	//Иначе
	//	
	//	Текст = Новый ЧтениеТекста;
	//	Текст.Открыть(Объект.ПутьКФайлу);
	//	
	//	ТекСтрока = Текст.ПрочитатьСтроку();
	//	
	//	НомерСтроки = 1;
	//	
	//	Пока ТекСтрока <> Неопределено Цикл
	//		
	//		ЧастиСтроки = СтрРазделить(ТекСтрока, ";");
	//		
	//		Если ЧастиСтроки.Количество() < 3 Тогда
	//			Сообщение = Новый СообщениеПользователю;
	//			Сообщение.Текст = "В строке № " + НомерСтроки + " неверный формат";
	//			Сообщение.Сообщить();
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		НоваяСтрока = Объект.ДанныеФайла.Добавить();
	//		НоваяСтрока.Наименование = ЧастиСтроки[0];
	//		НоваяСтрока.НаименованиеПолное = ЧастиСтроки[1];
	//		НоваяСтрока.УНП = ЧастиСтроки[2];
	//		
	//		ТекСтрока = Текст.ПрочитатьСтроку();  
	//		НомерСтроки = НомерСтроки + 1;
	//	
	//	КонецЦикла;
	//	
	//	
	//КонецЕсли;
	//
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл_CSV()

	Объект.ДанныеФайла.Очистить();
	
	СпособЧтения = "ЧтениеТекста";//"ТекстовыйДокумент";
	Если СпособЧтения = "ТекстовыйДокумент" Тогда
		
		Текст = Новый ТекстовыйДокумент;
		Текст.Прочитать(Объект.ПутьКФайлу, КодировкаТекста.UTF8);
		КоличествоСтрок = Текст.КоличествоСтрок();
		
		Для НомерСтроки=2 По КоличествоСтрок Цикл
			
			ТекСтрока = Текст.ПолучитьСтроку(НомерСтроки);
			ЧастиСтроки = СтрРазделить(ТекСтрока, ";");
			
			Если ЧастиСтроки.Количество() < 3 Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "В строке № " + НомерСтроки + " неверный формат";
				Сообщение.Сообщить();
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Объект.ДанныеФайла.Добавить();
			НоваяСтрока.Наименование = ЧастиСтроки[0];
			НоваяСтрока.НаименованиеПолное = ЧастиСтроки[1];
			НоваяСтрока.УНП = ЧастиСтроки[2];
			
		КонецЦикла;
		
	Иначе
		
		Текст = Новый ЧтениеТекста;
		Текст.Открыть(Объект.ПутьКФайлу, КодировкаТекста.UTF8);
		
		ТекСтрока = Текст.ПрочитатьСтроку();
		
		НомерСтроки = 1;
		
		Пока ТекСтрока <> Неопределено Цикл
			
			Если НомерСтроки = 1 Тогда
				НомерСтроки = НомерСтроки + 1;  
				ТекСтрока = Текст.ПрочитатьСтроку();
				Продолжить;
			КонецЕсли;
			
			ЧастиСтроки = СтрРазделить(ТекСтрока, ";");
			
			Если ЧастиСтроки.Количество() < 3 Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "В строке № " + НомерСтроки + " неверный формат";
				Сообщение.Сообщить();
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Объект.ДанныеФайла.Добавить();
			НоваяСтрока.Наименование = ЧастиСтроки[0];
			НоваяСтрока.НаименованиеПолное = ЧастиСтроки[1];
			НоваяСтрока.УНП = ЧастиСтроки[2];
			
			ТекСтрока = Текст.ПрочитатьСтроку();  
			НомерСтроки = НомерСтроки + 1;
		
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл_XLS()
	
	Файл = Новый Файл(Объект.ПутьКФайлу);
	Расширение = Файл.Расширение;
	
	//получить двоичные данные файла
	ДанныеФайла = Новый ДвоичныеДанные(Объект.ПутьКФайлу);
	
	//поместить данные файла во врем. хранилище
	АдресДанных = ПоместитьВоВременноеХранилище(ДанныеФайла);
	
	//обработать файл на сервере
	ПрочитатьФайл_XLS_НаСервере(АдресДанных, Расширение);
	
КонецПроцедуры               

&НаСервере
Процедура ПрочитатьФайл_XLS_НаСервере(АдресДанных, Расширение)
	
	//сформировать имя временного файла
	ПутьКФайлуНаСервере = ПолучитьИмяВременногоФайла(Расширение);
	
	//получить данные файла из врем. хранилища
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресДанных);
	
	//записать данные файла в файловую систему сервера
	ДанныеФайла.Записать(ПутьКФайлуНаСервере);
	
	Объект.ДанныеФайла.Очистить();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Прочитать(ПутьКФайлуНаСервере, СпособЧтенияЗначенийТабличногоДокумента.Значение);

	КоличествоСтрок = ТабДок.ВысотаТаблицы;
    КоличествоКолонок = 3;//ТабДок.ШиринаТаблицы;

	Для НомерСтроки=2 По КоличествоСтрок Цикл
		
		Наименование		= ТабДок.Область(НомерСтроки,1).Текст;
		НаименованиеПолное	= ТабДок.Область(НомерСтроки,2).Текст;
		УНП					= ТабДок.Область(НомерСтроки,3).Текст;
		
		Попытка
			ДатаРегистрации = ТабДок.Область(НомерСтроки,4).Значение;
		Исключение
			ДатаРегистрации = '00010101';
		КонецПопытки;
		     
		Если ПустаяСтрока(Наименование) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.ДанныеФайла.Добавить();
		НоваяСтрока.Наименование = Наименование;
		НоваяСтрока.НаименованиеПолное = НаименованиеПолное;
		НоваяСтрока.УНП = УНП;
		
	КонецЦикла;
	
КонецПроцедуры // ПрочитатьФайл_XLS_НаСервере()

&НаКлиенте
Процедура ПрочитатьФайл_DBF()
	
	Объект.ДанныеФайла.Очистить();
	
	ФайлДБФ = Новый XBase;
	ФайлДБФ.ОткрытьФайл(Объект.ПутьКФайлу);
	
	Если НЕ ФайлДБФ.Первая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В выбранном файле нет данных";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;  

	Пока НЕ ФайлДБФ.ВКонце() Цикл
		
		НоваяСтрока = Объект.ДанныеФайла.Добавить();
		НоваяСтрока.Наименование	   = ФайлДБФ.NAME;
		НоваяСтрока.НаименованиеПолное = ФайлДБФ.FULL_NAME;
		НоваяСтрока.УНП				   = ФайлДБФ.UNP;
		
		ФайлДБФ.Следующая();

	КонецЦикла;
	
	ФайлДБФ.ЗакрытьФайл();

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл_XML()
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл_JSON()
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайлСаша(Команда)
		
Текст = Новый ЧтениеТекста("d:\Сезон 2019_2020.txt", КодировкаТекста.UTF8); 

Стр = Текст.ПрочитатьСтроку(); 
	
 // Прочитали 1 тур думаем как это грузить на форму
 Пока Стр <> Неопределено Цикл // строки читаются до символа перевода строки  

	 
// Получим номер тура строкой 

Если СтрДлина(Стр) = 5 Тогда
 НомерТура = Прав(Стр, 1);
 СтрокаБезНомерТура = СокрЛП(Лев(Стр, 4));
 НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
ИначеЕсли  СтрДлина(Стр) = 6 Тогда
 НомерТура = Прав(Стр, 2);
 СтрокаБезНомерТура = Лев(Стр, 3);
 НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
КонецЕсли;  
	 
// Убираем строчку где (Тур	Дата, время	Матч	Счет)	 
	 
	Если СтрНайти(Стр, "Тур") > 0 или СтрНайти(Стр, "Счет") > 0 Тогда 
		Стр = Текст.ПрочитатьСтроку(); 
		Продолжить;	
	КонецЕсли;
	// Убираем пробелы в строке слева и справа
	 Стр = СокрЛП(Стр); 
	 
	 // Получаем Дату
	 НашаДатаТекстНеправильный = Лев(Стр,10);  
	 Год = Прав(НашаДатаТекстНеправильный,4);
	 Месяц = Сред(НашаДатаТекстНеправильный,4,2);
	 День = Лев(НашаДатаТекстНеправильный,2);
	 НашаДатаСтрока = Год + Месяц + День;
	 НашаДата = Дата(НашаДатаСтрока);
	 //КомандаХозяев
	 СтрБезДаты = СокрЛП(Сред(Стр,11)); 
	 Счет = Прав(СтрБезДаты,3);
	 ЗнакТире = СтрНайти(СтрБезДаты, "–");	 
	 СтрКомандаХозяев = СокрЛП(Лев(СтрБезДаты, ЗнакТире-1)); 
	 
	  //КомандаГостей 
	 СтрБезСчетаИДаты = СокрЛП(Лев(СтрБезДаты,СтрДлина(СтрБезДаты)-3)); 
	 ЗнакТиреСправа = СтрНайти(СтрБезСчетаИДаты, "–",НаправлениеПоиска.СКонца);	 
	 СтрКомандаГостей = СокрЛП(Сред(СтрБезСчетаИДаты, ЗнакТире + 1)); 
     	 
	// Сезон строка
	 Сезон = СокрЛП(Объект.Сезоны);	
	 // Заполнили Табличную часть на форме
	 НоваяСтрока = Объект.ДанныеФайла1.Добавить();
	 НоваяСтрока.Сыгран = Истина;  
	 НоваяСтрока.Дата = НашаДата;
	 НоваяСтрока.Турнир = "РФПЛ";  
	 НоваяСтрока.КомандаХозяев = СтрКомандаХозяев;
	 НоваяСтрока.Счет = Счет;  
	 НоваяСтрока.КомандаГостей = СтрКомандаГостей; 
	 НоваяСтрока.КтоИграл = СтрБезСчетаИДаты; 
	 НоваяСтрока.Сезон = Сезон;
	 НоваяСтрока.Тур = НомерТураПолный;	 
	 НоваяСтрока.ЗабилиХозяева = Лев(Счет,1);
	 НоваяСтрока.ЗабилиГости = Прав(Счет,1);  
	 
	 //Сообщить(Стр);  
	 // Читаем следующую строку
	 Стр = Текст.ПрочитатьСтроку();
 КонецЦикла;    
 
КонецПроцедуры   

&НаСервере
Процедура ЗаписатьДанныеТурыНаСервере()  
	
Для каждого СтрокаДанных Из Объект.ДанныеФайла1 Цикл
		
		//Если СтрокаДанных.Контрагент.Пустая() Тогда
			
			//создать нового контрагента
			НовыйТур = Справочники.Туры.СоздатьЭлемент();
			НовыйТур.Наименование = СтрокаДанных.УНП;
			НовыйТур.ДатаНачала = СтрокаДанных.Наименование;
			НовыйТур.ДатаОкончания = СтрокаДанных.НаименованиеПолное;  
			НовыйТур.Турнир = Истина;
			НовыйТур.Сезон = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
			НовыйТур.НомерТура = Перечисления.КатегорииКонтрагентов.Обычный;
			
			//НовыйКонтрагент.ОбменДанными.Загрузка = Истина;
			
			Попытка
				НовыйТур.Записать();  	       
				//СтрокаДанных.Контрагент = НовыйКонтрагент.Ссылка;
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось создать Тур, номер строки: " + СтрокаДанных.НомерСтроки;
				Сообщение.Сообщить();
			КонецПопытки;
			
		//Иначе
			//пока что пропустить...
		
		//КонецЕсли;
		
	КонецЦикла;     
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеТуры(Команда)
	ЗаписатьДанныеТурыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайлПолный(Команда)
	
	//ПерМоя = "2 тур";	
		
	Текст = Новый ЧтениеТекста("d:\Сезон 2019_2020.txt", КодировкаТекста.UTF8); 

	Стр = СокрЛП(Текст.ПрочитатьСтроку()); 
	Стр = СокрЛП(Стр);

		
	 // Прочитали 1 тур думаем как это грузить на форму
	 Пока Стр <> Неопределено Цикл // строки читаются до символа перевода строки  
 	     Стр = СокрЛП(Стр);
// Получим номер тура строкой 

	Если СтрДлина(Стр) = 5 Тогда
		НомерТура = Лев(Стр, 1);
		СтрокаБезНомерТура = СокрЛП(Прав(Стр, 3));
		НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
		Стр = Текст.ПрочитатьСтроку(); 
		Стр = СокрЛП(Стр); 
		Продолжить;	
	ИначеЕсли  СтрДлина(Стр) = 6 Тогда
		НомерТура = Лев(Стр, 2);
		СтрокаБезНомерТура = СокрЛП(Прав(Стр, 3));
		НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
		Стр = Текст.ПрочитатьСтроку(); 
		Стр = СокрЛП(Стр);
		Продолжить;	
	КонецЕсли;  

// Убираем строчку где (Тур	Дата, время	Матч	Счет)	 
	 
	//Если СтрНайти(Стр, "Тур") > 0 и СтрНайти(Стр, "Да") > 0 Тогда 
	//	Стр = Текст.ПрочитатьСтроку(); 
	//	Продолжить;	
	//КонецЕсли;
	
	// Убираем пробелы в строке слева и справа
	 Стр = СокрЛП(Стр); 
	 
	 // Получаем Дату	 
	 НашаДатаТекстНеправильный = Сред(Стр, 7,19);      
	 //НашаДатаКакДата = Дата(Строка(НашаДатаТекстНеправильный));
	// 
	//ФорматДаты = Новый Формат("Д.М.Г Ч:М:С");  
	//Дата = СтрокаВДату("19.11.2024 15:45:20", ФорматДаты);  
	//Сообщить(Дата);  // 19.11.2024 15:45:20  

	 
	 //Год = Сред(НашаДатаТекстНеправильный,7,4);
	 //Месяц = Сред(НашаДатаТекстНеправильный,4,2);
	 //День = Лев(НашаДатаТекстНеправильный,2);
	 //ЧасыСТочками = Прав(НашаДатаТекстНеправильный,8); 
	 //ЧасыБезТочек = СтрЗаменить(ЧасыСТочками,":","");
	 //НашаДатаСтрокаБезКавычек = Год + Месяц + День + ЧасыБезТочек;  
	 ////НашаДатаСтрока = """ + НашаДатаСтрокаБезКавычек + """;
	 //НашаДата = Дата(НашаДатаСтрокаБезКавычек);     
	 
	 СтрДляКоманд = Сред(Стр,33);
	 СтрЗнакДвоеточия = СтрНайти(СтрДляКоманд,":"); 
	 СтрДляКомандСтрДлина= СтрДлина(СтрДляКоманд);    
	 СтрХозяева = Лев(СтрДляКоманд,СтрЗнакДвоеточия); 
     СтрГости = Прав(СтрДляКоманд,СтрЗнакДвоеточия);
	 	 
	 
	 // Если СтрНайти(СтрДляКоманд,"Динамо Махачкала") > 0 Тогда
	 //    СтрХозяева = Лев(СтрДляКоманд,СтрЗнакДвоеточия+5); 
	 //Иначе
	 //    СтрГости = Прав(СтрДляКоманд,СтрЗнакДвоеточия);	 
	 //КонецЕсли;

	 
	 //Если СтрНайти(СтрДляКоманд,"ДинамоМ") > 0 Тогда
	 //    СтрГости = Прав(СтрДляКоманд,СтрЗнакДвоеточия+5);
	 //Иначе
	 //    СтрГости = Прав(СтрДляКоманд,СтрЗнакДвоеточия);	 
	 //КонецЕсли;
	 
	 
	 //КомандаХозяев    
	 СтрКомандаХозяев = НайтиКомандуХозяев(СтрХозяева);
	 
	 //ЗнакНачало =  СтрНайти(Стр,СтрКомандаХозяев);
	 //
	 //Если  ЗнакНачало > 0 Тогда 		 
	 //    СтрБезХозяев = Сред(Стр, ЗнакНачало);		 
	 //КонецЕсли; 
	 	 
	  //КомандаГостей 
	 СтрКомандаГостей = НайтиКомандуГостей(СтрГости);  
	 
	 
	// Счет 
	 СтрБезДаты = СокрЛП(Сред(Стр,36,41));      
	 СчетЗнакДвоеточия =  СтрНайти(СтрБезДаты,":");
	 Счет = сред(СтрБезДаты, (СчетЗнакДвоеточия-1),3); 
     	 
	// Сезон строка
	 Сезон = СокрЛП(Объект.Сезоны);	
	 // Заполнили Табличную часть на форме
	 НоваяСтрока = Объект.ДанныеФайла1.Добавить();
	 НоваяСтрока.Сыгран = Истина;  
	 НоваяСтрока.Дата = НашаДатаТекстНеправильный;    
	 НоваяСтрока.Турнир = "РФПЛ";  
	 НоваяСтрока.КомандаХозяев = СтрКомандаХозяев;
	 НоваяСтрока.Счет = Счет;  
	 НоваяСтрока.КомандаГостей = СтрКомандаГостей; 
	 НоваяСтрока.КтоИграл = СтрКомандаХозяев + " - " +  СтрКомандаГостей; 
	 НоваяСтрока.Сезон = Сезон;
	 НоваяСтрока.Тур = НомерТураПолный;	 
	 НоваяСтрока.ЗабилиХозяева = Лев(Счет,1);
	 НоваяСтрока.ЗабилиГости = Прав(Счет,1);  
	 
	 //Сообщить(Стр);  
	 // Читаем следующую строку
	 Стр = Текст.ПрочитатьСтроку();
	  КонецЦикла; 

КонецПроцедуры


#КонецОбласти   

Функция НайтиКомандуХозяев(СтрокаПоиска)  
	
	КомандаХозяев = "";           	
	
	//Как создать массив
	МассивКоманд = Новый Массив;
	
	//Как добавить в массив элементы
	МассивКоманд.Добавить("Динамо2");//0
	МассивКоманд.Добавить("Спартак");//1
	МассивКоманд.Добавить("Ростов");//2
	МассивКоманд.Добавить("Оренбург");//3 
	МассивКоманд.Добавить("Крылья");//4
	МассивКоманд.Добавить("ЦСКА");//5
	МассивКоманд.Добавить("Зенит");//6
	МассивКоманд.Добавить("Ахмат");//7
	МассивКоманд.Добавить("Краснодар");//8
	МассивКоманд.Добавить("Локомотив");//9
	МассивКоманд.Добавить("Рубин");//10
	МассивКоманд.Добавить("Химки");//11
	МассивКоманд.Добавить("Факел");//12
	МассивКоманд.Добавить("Акрон");//13
	МассивКоманд.Добавить("Пари НН");//14  
	МассивКоманд.Добавить("Динамо");//15    
	
	//Как найти значение в массиве   
	
	//вариант № 2 (цикл по счетчику)
	Для Счетчик=0 По МассивКоманд.ВГраница() Цикл	
		Если СтрНайти(СтрокаПоиска,МассивКоманд[Счетчик])> 0 Тогда 
		//	Если МассивКоманд[Счетчик] = "Динамо" Тогда 
		//		
		//
		//	
		//
		//Иначе
		//
		//	
		//
		//КонецЕсли;	
		КомандаХозяев = МассивКоманд[Счетчик];	
		Прервать;			
		КонецЕсли;	
	КонецЦикла; 
	Возврат КомандаХозяев; 	
КонецФункции         


Функция НайтиКомандуГостей(СтрокаПоиска)  
	
	КомандаГостей = "";
	
	
	//Как создать массив
	МассивКомандГости = Новый Массив;
	
	//Как добавить в массив элементы
	МассивКомандГости.Добавить("Динамо2");//0
	МассивКомандГости.Добавить("Спартак");//1
	МассивКомандГости.Добавить("Ростов");//2
	МассивКомандГости.Добавить("Оренбург");//3 
	МассивКомандГости.Добавить("Крылья");//4
	МассивКомандГости.Добавить("ЦСКА");//5
	МассивКомандГости.Добавить("Зенит");//6
	МассивКомандГости.Добавить("Ахмат");//7
	МассивКомандГости.Добавить("Краснодар");//8
	МассивКомандГости.Добавить("Локомотив");//9
	МассивКомандГости.Добавить("Рубин");//10
	МассивКомандГости.Добавить("Химки");//11
	МассивКомандГости.Добавить("Факел");//12
	МассивКомандГости.Добавить("Акрон");//13
	МассивКомандГости.Добавить("Пари НН");//14  
	МассивКомандГости.Добавить("Динамо");//15   
	
	//	//Как удалить элемент массива
	//КомандаХозяевИндекс = МассивКомандГости.Найти(КомандаХозяевУдалить);
	//Если КомандаХозяевИндекс <> Неопределено Тогда
	//	МассивКомандГости.Удалить(КомандаХозяевИндекс);	
	//КонецЕсли;

	//Как найти значение в массиве   
	
	//вариант № 2 (цикл по счетчику)
	Для Счетчик=0 По МассивКомандГости.ВГраница() Цикл	
		Если СтрНайти(СтрокаПоиска,МассивКомандГости[Счетчик])> 0 Тогда 
		КомандаГостей = МассивКомандГости[Счетчик];	
		Прервать;			
		КонецЕсли;	
	КонецЦикла; 
	Возврат КомандаГостей; 	
КонецФункции 

&НаКлиенте
Процедура ОчиститьТаблицу(Команда)
	Объект.ДанныеФайла1.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьСтолбецХозяева(Команда)   	
	
	//Стр = Элементы.ДанныеФайла1.ТекущиеДанные;       
	//а=5;  
	
	Для каждого СтрокаТЧ Из Объект.ДанныеФайла1 Цикл  
		
		Если СтрокаТЧ.КомандаХозяев = "Арсенал" Тогда
		   СтрокаТЧ.КомандаХозяев = "Арсенал Т";
	   КонецЕсли; 
	   
	   		Если СтрокаТЧ.КомандаХозяев = "Торпедо" Тогда
		   СтрокаТЧ.КомандаХозяев = "Торпедо М";
		   КонецЕсли;

		
		Если СтрокаТЧ.КомандаХозяев = "Динамо" Тогда
		   СтрокаТЧ.КомандаХозяев = "Динамо М";			
	   КонецЕсли;   
	   
	   Если СтрокаТЧ.КомандаХозяев = "Крылья Советов" Тогда
		   СтрокаТЧ.КомандаХозяев = "Кр. Советов";			
	   КонецЕсли;  
	   
	      Если СтрокаТЧ.КомандаХозяев = "Спартак" Тогда
		   СтрокаТЧ.КомандаХозяев = "Спартак М";			
	   КонецЕсли; 
	   
	   
	      Если СтрокаТЧ.КомандаХозяев = "Динамо Махачкала" Тогда
		   СтрокаТЧ.КомандаХозяев = "Динамо Мх";			
	   КонецЕсли; 	
	   
	      Если СтрокаТЧ.КомандаХозяев = "Пари Нижний Новгород" Тогда
		   СтрокаТЧ.КомандаХозяев = "Пари НН";			
	   КонецЕсли; 		   
	   
                               
	   
	   /////////////////////////////////////////////////////////////  
	   
	   
	      		Если СтрокаТЧ.КомандаГостей = "Торпедо" Тогда
		   СтрокаТЧ.КомандаГостей = "Торпедо М";
		   КонецЕсли;


	   	
		Если СтрокаТЧ.КомандаГостей = "Арсенал" Тогда
		   СтрокаТЧ.КомандаГостей = "Арсенал Т";			
	   КонецЕсли;
          
	   		Если СтрокаТЧ.КомандаГостей = "Динамо" Тогда
		   СтрокаТЧ.КомандаГостей = "Динамо М";			
	   КонецЕсли;   
	   
	   Если СтрокаТЧ.КомандаГостей = "Крылья Советов" Тогда
		   СтрокаТЧ.КомандаГостей = "Кр. Советов";			
	   КонецЕсли;  
	   
	      Если СтрокаТЧ.КомандаГостей = "Спартак" Тогда
		   СтрокаТЧ.КомандаГостей = "Спартак М";			
	   КонецЕсли; 
	   
	   
	     Если СтрокаТЧ.КомандаГостей = "Динамо Махачкала" Тогда
		   СтрокаТЧ.КомандаГостей = "Динамо Мх";			
	   КонецЕсли; 
	   
	   Если СтрокаТЧ.КомандаГостей = "Пари Нижний Новгород" Тогда
		   СтрокаТЧ.КомандаГостей = "Пари НН";			
	   КонецЕсли; 		   
	   


	   
	   
		//СтрокаФайла = СтрокаТЧ.Наименование + ";" + СтрокаТЧ.НаименованиеПолное + ";" + СтрокаТЧ.УНП;
		Сообщить("Хозяева:  " + СтрокаТЧ.КомандаХозяев + " Гости: " + СтрокаТЧ.КомандаГостей);
		
		
	КонецЦикла; 
	
	//Для Каждого Стр Из Элементы.ДанныеФайла1 Цикл 
	//	
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = Стр.КомандаХозяев + "-" + Стр.ЗабилиХозяева;
	//	Сообщение.Сообщить(); 		
	//	
	//	//Стр.Цена = ЗагрузитьЦеныКоньковоНаСервере(Стр.Номенклатура);  
	//	//Стр.Сумма = Стр.Количество * Стр.Цена;
	//КонецЦикла;  
	

	
	
	//ТекСтрока = ЭлементыФормы.Дети.ТекущиеДанные;       
	//ТекСтрока.ФИО = СокрЛП(ТекСтрока.ФИО);


	
	//Для каждого СтрокаТЧ Из Объект.ДанныеФайла1 Цикл       
	//	Сообщить(СтрокаТЧ);
	//	
	//	//СтрокаФайла = СтрокаТЧ.Наименование + ";" + СтрокаТЧ.НаименованиеПолное + ";" + СтрокаТЧ.УНП;
	//	//Текст.ДобавитьСтроку(СтрокаФайла);      
	//	//Сообщение = Новый СообщениеПользователю;
	//	//Сообщение.Текст = СтрокаТЧ.;
	//	//Сообщение.Сообщить();
	//КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПровестиДокументы(Команда)
	СоздатьПровестиДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьПровестиДокументыНаСервере()  
  //	
	//Организация - "Электроник ООО"
	//Склад - "Основной"
	//Контрагент - "Прокси Торг ООО"
	//договор - "00020";
	//Номенклатура "Робот-пылесос Redmond RV-R650S WiFi"  
	
   // Создаем Новый Тур - документ
	
	НовыйТур = Документы.Тур.СоздатьДокумент();    
	
	//реквизиты шапки  
	//ТЗ_Дата = Объект.ДанныеФайла1.ВыгрузитьКолонку("Дата");   
	
	 //а=5;
	//ДанныеФайла1.
	//НовыйТур.Дата = ТекущаяДата();
	
	////реквизиты шапки 
	
	
	НовыйТур.Сезон = Константы.ТекущийСезон.Получить();	
	
	//Если  Справочники.Сезоны.НайтиПоНаименованию("Сезон 2024/2025 Премьер-лига") <> 0 или Справочники.Сезоны.НайтиПоНаименованию("Сезон 2024/2025 Премьер-лига") <>  Неопределено Тогда
	//	Объект.Сезоны.Ссылка = Справочники.Организации.НайтиПоНаименованию(СтрокаТур.Хозяин);	  
	//ИначеЕсли 
	//	Справочники.Сезоны.НайтиПоНаименованию("Сезон 2024/2025 Премьер-лига") = 0 или Справочники.Сезоны.НайтиПоНаименованию("Сезон 2024/2025 Премьер-лига") =  Неопределено Тогда
	//    Сообщить("Нет снзона");
	//КонецЕсли; 
	//
	//НовыйТур.Организация = Справочники.Организации.НайтиПоНаименованию("Электроник ООО");
	//НовыйТур.Склад = Справочники.Склады.НайтиПоНаименованию("Основной");
	//НовыйТур.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("Прокси Торг ООО");
	//НовыйТур.Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("00020");
	//
	//табличная часть
	
	
	
	
	//СтрокаТовары = НовыйТур.Игры.Добавить();
	//СтрокаТовары.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию("Робот-пылесос Redmond RV-R650S WiFi");
	//СтрокаТовары.Количество = 3;
	//СтрокаТовары.Цена = 1000;
	//
	//ИменаРеквизитов = "ЕдиницаИзмерения,СтавкаНДС";	
	//РеквизитыНоменклатуры = ОбщегоНазначенияВызовСервера.ПолучитьРеквизитыНоменклатуры(СтрокаТовары.Номенклатура, ИменаРеквизитов);

	//СтрокаТовары.ЕдиницаИзмерения = РеквизитыНоменклатуры.ЕдиницаИзмерения;
	//СтрокаТовары.СтавкаНДС = РеквизитыНоменклатуры.СтавкаНДС;
	//
	//ОбработкаТабличнхЧастейСервер.РассчитатьСуммыВСтрокеТабличнойЧасти(СтрокаТовары);           	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Для каждого СтрокаТЧ Из Объект.ДанныеФайла1 Цикл   
		
	СтрокаТур = НовыйТур.Игры.Добавить();
	
		//реквизиты шапки
	СтрокаТур.Дата = СтрокаТЧ.Дата;    
	
	//Если  Справочники.Команды.НайтиПоНаименованию(СтрокаТЧ.Хозяин) <> 0 или Справочники.Команды.НайтиПоНаименованию(СтрокаТЧ.Хозяин)  <>  Неопределено Тогда  
	  КомандаХозяинПоиска =  СтрокаТЧ.КомандаХозяев;
	  СтрокаТур.Хозяин = Справочники.Команды.НайтиПоНаименованию(КомандаХозяинПоиска);	
  //КонецЕсли;         
  
  
  //Если  Справочники.Команды.НайтиПоНаименованию(СтрокаТЧ.Гость) <> 0 или Справочники.Команды.НайтиПоНаименованию(СтрокаТЧ.Гость)  <>  Неопределено Тогда
     КомандаХозяинПоиска =  СтрокаТЧ.КомандаГостей;   
	 СтрокаТур.Гость = Справочники.Команды.НайтиПоНаименованию(КомандаХозяинПоиска);	
	//КонецЕсли;

		
	//СтрокаТур.Гость = СтрокаТЧ.Дата;  
	СтрокаТур.Счет = СтрокаТЧ.Счет; 
	СтрокаТур.МП = СтрокаТЧ.ЗабилиГости; 
	СтрокаТур.МЗ = СтрокаТЧ.ЗабилиХозяева; 
	СтрокаТур.Сыгран = Истина; 
	
	СыграноИгр = НовыйТур.Игры.Количество(); 
	
	// Дата 
	Если  НовыйТур.Дата = '00010101000000' Тогда
		// Дата равна нулевой (01.01.0001)  
		НовыйТур.Дата = СтрокаТур.Дата; 
	//Иначе
	//	// Дата не нулевая 		
	КонецЕсли;
	
		
	
	
	//СтрокаТур.Сыгран = СтрокаТЧ.Сыгран;  
	//СтрокаТур.МЗ = 1;
	//СтрокаТур.МП = 1;
		
	 	   //   Если СтрокаТЧ.КомандаГостей = "Динамо2" Тогда
	   //    СтрокаТЧ.КомандаГостей = "Динамо Махачкала";			
	   //КонецЕсли; 

	   
	   
		////СтрокаФайла = СтрокаТЧ.Наименование + ";" + СтрокаТЧ.НаименованиеПолное + ";" + СтрокаТЧ.УНП;
		Сообщить("Хозяева:  " + СтрокаТЧ.КомандаХозяев + " Гости: " + СтрокаТЧ.КомандаГостей);
		
		
	КонецЦикла; 

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	НовыйТур.Записать(); 
	Сообщить("Создан документ: " + НовыйТур.Номер + "  " + НовыйТур.Дата);	
	
	
	// Вставить содержимое обработчика.
	  
	
КонецПроцедуры

&НаКлиенте
Процедура СоздаемДокументы(Команда) 
	СоздаемДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздаемДокументыНаСервере()  
	
	НовыйТур = Документы.Тур.СоздатьДокумент();    
	
	НовыйТур.Сезон = Константы.ТекущийСезон.Получить();	

	       
	Для каждого СтрокаТЧ Из Объект.ДанныеФайла1 Цикл  
		
		//Для а = 1 По 8 Цикл
		
		//Пока не СтрокаТЧ.НомерСтроки = 9 Цикл     
		
		// Новый документ
		//НовыйТур = Документы.Тур.СоздатьДокумент();    
		
		////реквизиты шапки  
		
		
		
		НовыйТур.Сезон = Константы.ТекущийСезон.Получить();	
		
		
		СтрокаТур = НовыйТур.Игры.Добавить();
		
		//реквизиты шапки
		СтрокаТур.Дата = СтрокаТЧ.Дата;    
		
		//Если  Справочники.Команды.НайтиПоНаименованию(СтрокаТЧ.Хозяин) <> 0 или Справочники.Команды.НайтиПоНаименованию(СтрокаТЧ.Хозяин)  <>  Неопределено Тогда  
		КомандаХозяинПоиска =  СтрокаТЧ.КомандаХозяев;
		СтрокаТур.Хозяин = Справочники.Команды.НайтиПоНаименованию(КомандаХозяинПоиска);	
		//КонецЕсли;         
		
		
		//Если  Справочники.Команды.НайтиПоНаименованию(СтрокаТЧ.Гость) <> 0 или Справочники.Команды.НайтиПоНаименованию(СтрокаТЧ.Гость)  <>  Неопределено Тогда
		КомандаХозяинПоиска =  СтрокаТЧ.КомандаГостей;   
		СтрокаТур.Гость = Справочники.Команды.НайтиПоНаименованию(КомандаХозяинПоиска);	
		//КонецЕсли;
		
		
		//СтрокаТур.Гость = СтрокаТЧ.Дата;  
		СтрокаТур.Счет = СтрокаТЧ.Счет; 
		СтрокаТур.МП = СтрокаТЧ.ЗабилиГости; 
		СтрокаТур.МЗ = СтрокаТЧ.ЗабилиХозяева; 
		СтрокаТур.Сыгран = Истина; 
		
		СыграноИгр = НовыйТур.Игры.Количество(); 
		
		// Дата 
		Если  НовыйТур.Дата = '00010101000000' Тогда
			// Дата равна нулевой (01.01.0001)  
			НовыйТур.Дата = СтрокаТур.Дата;
			НовыйТур.Номер = "1";
			
			//Иначе
			//	// Дата не нулевая 		
		КонецЕсли;
		
		Сообщить(СтрокаТЧ.НомерСтроки);
		
	КонецЦикла; 
	
	НовыйТур.Записать(); 
	Сообщить("Создан документ: " + НовыйТур.Номер + "  " + НовыйТур.Дата);	

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайлПолныйсПробелом(Команда)
	//ПерМоя = "2 тур";	
		
	Текст = Новый ЧтениеТекста("d:\win0.txt", КодировкаТекста.UTF8); 

	Стр = СокрЛП(Текст.ПрочитатьСтроку()); 
	Стр = СокрЛП(Стр);

		
	 // Прочитали 1 тур думаем как это грузить на форму
	 Пока Стр <> Неопределено Цикл // строки читаются до символа перевода строки  
 	     Стр = СокрЛП(Стр);
// Получим номер тура строкой 

	Если СтрДлина(Стр) = 5 Тогда
		НомерТура = Лев(Стр, 1);
		СтрокаБезНомерТура = СокрЛП(Прав(Стр, 3));
		НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
		Стр = Текст.ПрочитатьСтроку(); 
		Стр = СокрЛП(Стр); 
		Продолжить;	
	ИначеЕсли  СтрДлина(Стр) = 6 Тогда
		НомерТура = Лев(Стр, 2);
		СтрокаБезНомерТура = СокрЛП(Прав(Стр, 3));
		НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
		Стр = Текст.ПрочитатьСтроку(); 
		Стр = СокрЛП(Стр);
		Продолжить;	
	КонецЕсли;  

// Убираем строчку где (Тур	Дата, время	Матч	Счет)	 
	 
	//Если СтрНайти(Стр, "Тур") > 0 и СтрНайти(Стр, "Да") > 0 Тогда 
	//	Стр = Текст.ПрочитатьСтроку(); 
	//	Продолжить;	
	//КонецЕсли;
	
	// Убираем пробелы в строке слева и справа
	 Стр = СокрЛП(Стр); 
	 
	 // Получаем Дату	 
	 НашаДатаТекстНеправильный = Сред(Стр, 7,19);      
	 //НашаДатаКакДата = Дата(Строка(НашаДатаТекстНеправильный));
	// 
	//ФорматДаты = Новый Формат("Д.М.Г Ч:М:С");  
	//Дата = СтрокаВДату("19.11.2024 15:45:20", ФорматДаты);  
	//Сообщить(Дата);  // 19.11.2024 15:45:20  

	 
	 //Год = Сред(НашаДатаТекстНеправильный,7,4);
	 //Месяц = Сред(НашаДатаТекстНеправильный,4,2);
	 //День = Лев(НашаДатаТекстНеправильный,2);
	 //ЧасыСТочками = Прав(НашаДатаТекстНеправильный,8); 
	 //ЧасыБезТочек = СтрЗаменить(ЧасыСТочками,":","");
	 //НашаДатаСтрокаБезКавычек = Год + Месяц + День + ЧасыБезТочек;  
	 ////НашаДатаСтрока = """ + НашаДатаСтрокаБезКавычек + """;
	 //НашаДата = Дата(НашаДатаСтрокаБезКавычек);     
	 
	 СтрДляКоманд = Сред(Стр,33);
	 СтрЗнакДвоеточия = СтрНайти(СтрДляКоманд,":"); 
	 СтрДляКомандСтрДлина= СтрДлина(СтрДляКоманд);    
	 СтрХозяева = Лев(СтрДляКоманд,СтрЗнакДвоеточия); 
     СтрГости = Прав(СтрДляКоманд,СтрЗнакДвоеточия);
	 	 
	 
	 // Если СтрНайти(СтрДляКоманд,"Динамо Махачкала") > 0 Тогда
	 //    СтрХозяева = Лев(СтрДляКоманд,СтрЗнакДвоеточия+5); 
	 //Иначе
	 //    СтрГости = Прав(СтрДляКоманд,СтрЗнакДвоеточия);	 
	 //КонецЕсли;

	 
	 //Если СтрНайти(СтрДляКоманд,"ДинамоМ") > 0 Тогда
	 //    СтрГости = Прав(СтрДляКоманд,СтрЗнакДвоеточия+5);
	 //Иначе
	 //    СтрГости = Прав(СтрДляКоманд,СтрЗнакДвоеточия);	 
	 //КонецЕсли;
	 
	 
	 //КомандаХозяев    
	 СтрКомандаХозяев = НайтиКомандуХозяев(СтрХозяева);
	 
	 //ЗнакНачало =  СтрНайти(Стр,СтрКомандаХозяев);
	 //
	 //Если  ЗнакНачало > 0 Тогда 		 
	 //    СтрБезХозяев = Сред(Стр, ЗнакНачало);		 
	 //КонецЕсли; 
	 	 
	  //КомандаГостей 
	 СтрКомандаГостей = НайтиКомандуГостей(СтрГости);  
	 
	 
	// Счет 
	 СтрБезДаты = СокрЛП(Сред(Стр,36,41));      
	 СчетЗнакДвоеточия =  СтрНайти(СтрБезДаты,":");
	 Счет = сред(СтрБезДаты, (СчетЗнакДвоеточия-1),3);  

	 // Сезон строка
	 Сезон = СокрЛП(Объект.Сезоны);	
	 // Заполнили Табличную часть на форме
	 НоваяСтрока = Объект.ДанныеФайла1.Добавить();
	 НоваяСтрока.Сыгран = Истина;  
	 НоваяСтрока.Дата = НашаДатаТекстНеправильный;    
	 НоваяСтрока.Турнир = "РФПЛ";  
	 НоваяСтрока.КомандаХозяев = СтрКомандаХозяев;
	 НоваяСтрока.Счет = Счет;  
	 НоваяСтрока.КомандаГостей = СтрКомандаГостей; 
	 НоваяСтрока.КтоИграл = СтрКомандаХозяев + " - " +  СтрКомандаГостей; 
	 НоваяСтрока.Сезон = Сезон;
	 НоваяСтрока.Тур = НомерТураПолный;	 
	 НоваяСтрока.ЗабилиХозяева = Лев(Счет,1);
	 НоваяСтрока.ЗабилиГости = Прав(Счет,1); 
	 
		 //// Добавляем пустую строчку 
	 //НоваяСтрока1 = Объект.ДанныеФайла1.Добавить(); 

	 //
	 //Сообщить(Стр);  
	 // Читаем следующую строку
	 Стр = Текст.ПрочитатьСтроку();
	  КонецЦикла; 
КонецПроцедуры

#Область РазбитьТЧ

// Функция разбивает табличную часть на части по указанному количеству строк
// Возвращает массив табличных частей 

Функция РазбитьПоКоличествуСтрок(ИсходнаяТабличнаяЧасть, КоличествоСтрокВЧасти)
    
    Результат = Новый Массив;
    ТекущаяЧасть = Новый ТаблицаЗначений;
    
    // Копируем структуру исходной таблицы
    Для каждого Колонка Из ИсходнаяТабличнаяЧасть.Колонки Цикл
        ТекущаяЧасть.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
    КонецЦикла;
    
    Счетчик = 0;
    
    Для каждого Строка Из ИсходнаяТабличнаяЧасть Цикл
        НоваяСтрока = ТекущаяЧасть.Добавить();
        ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
        
        Счетчик = Счетчик + 1;
        
        Если Счетчик >= КоличествоСтрокВЧасти Тогда
            Результат.Добавить(ТекущаяЧасть);
            ТекущаяЧасть = Новый ТаблицаЗначений;
            
            // Копируем структуру снова
            Для каждого Колонка Из ИсходнаяТабличнаяЧасть.Колонки Цикл
                ТекущаяЧасть.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
            КонецЦикла;
            
            Счетчик = 0;
        КонецЕсли;
    КонецЦикла;
    
    // Добавляем последнюю часть, если в ней есть строки
    Если ТекущаяЧасть.Количество() > 0 Тогда
        Результат.Добавить(ТекущаяЧасть);
    КонецЕсли;
    
    Возврат Результат;  
	
	
КонецФункции

&НаКлиенте
Процедура РазбитьТЧ(Команда)
	РазбитьТЧНаСервере();
КонецПроцедуры

&НаСервере
Процедура РазбитьТЧНаСервере()   
	
	ИсходнаяТабличнаяЧасть = Объект.ДанныеФайла1; 
	КоличествоСтрокВЧасти = 8;
	
	Результат = Новый Массив;
    ТекущаяЧасть = Новый ТаблицаЗначений;
    
    // Копируем структуру исходной таблицы
    Для каждого Колонка Из ИсходнаяТабличнаяЧасть.Колонка Цикл
        ТекущаяЧасть.Колонка.Добавить(Колонка.Имя, Колонка.ТипЗначения);
    КонецЦикла;
    
    Счетчик = 0;
    
    Для каждого Строка Из ИсходнаяТабличнаяЧасть Цикл
        НоваяСтрока = ТекущаяЧасть.Добавить();
        ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
        
        Счетчик = Счетчик + 1;
        
        Если Счетчик >= КоличествоСтрокВЧасти Тогда
            Результат.Добавить(ТекущаяЧасть);
            ТекущаяЧасть = Новый ТаблицаЗначений;
            
            // Копируем структуру снова
            Для каждого Колонка Из ИсходнаяТабличнаяЧасть.Колонки Цикл
                ТекущаяЧасть.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
            КонецЦикла;
            
            Счетчик = 0;
        КонецЕсли;
    КонецЦикла;
    
    // Добавляем последнюю часть, если в ней есть строки
    Если ТекущаяЧасть.Количество() > 0 Тогда
        Результат.Добавить(ТекущаяЧасть);
	КонецЕсли;
	
	
    
	//Возврат Результат;  

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСезон(Команда)
	ЗагрузитьСезонНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСезонНаСервере()   
	
Текст = Новый ЧтениеТекста("d:\Сезон 2019_2020.txt", КодировкаТекста.UTF8); 

Стр = Текст.ПрочитатьСтроку(); 
	
 // Прочитали 1 тур думаем как это грузить на форму
 Пока Стр <> Неопределено Цикл // строки читаются до символа перевода строки  

	 
// Получим номер тура строкой 

Если СтрДлина(Стр) = 5 Тогда
 НомерТура = Прав(Стр, 1);
 СтрокаБезНомерТура = СокрЛП(Лев(Стр, 4));
 НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
ИначеЕсли  СтрДлина(Стр) = 6 Тогда
 НомерТура = Прав(Стр, 2);
 СтрокаБезНомерТура = Лев(Стр, 3);
 НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
КонецЕсли;  
	 
// Убираем строчку где (Тур	Дата, время	Матч	Счет)	 
	 
	Если СтрНайти(Стр, "Тур") > 0 или СтрНайти(Стр, "Счет") > 0 Тогда 
		Стр = Текст.ПрочитатьСтроку(); 
		Продолжить;	
	КонецЕсли;
	// Убираем пробелы в строке слева и справа
	 Стр = СокрЛП(Стр); 
	 
	 // Получаем Дату
	 НашаДатаТекстНеправильный = Лев(Стр,10);  
	 Год = Прав(НашаДатаТекстНеправильный,4);
	 Месяц = Сред(НашаДатаТекстНеправильный,4,2);
	 День = Лев(НашаДатаТекстНеправильный,2);
	 НашаДатаСтрока = Год + Месяц + День;
	 НашаДата = Дата(НашаДатаСтрока);
	 //КомандаХозяев
	 СтрБезДаты = СокрЛП(Сред(Стр,11)); 
	 Счет = Прав(СтрБезДаты,3);
	 ЗнакТире = СтрНайти(СтрБезДаты, "–");	 
	 СтрКомандаХозяев = СокрЛП(Лев(СтрБезДаты, ЗнакТире-1)); 
	 
	  //КомандаГостей 
	 СтрБезСчетаИДаты = СокрЛП(Лев(СтрБезДаты,СтрДлина(СтрБезДаты)-3)); 
	 ЗнакТиреСправа = СтрНайти(СтрБезСчетаИДаты, "–",НаправлениеПоиска.СКонца);	 
	 СтрКомандаГостей = СокрЛП(Сред(СтрБезСчетаИДаты, ЗнакТире + 1)); 
     	 
	// Сезон строка
	 Сезон = СокрЛП(Объект.Сезоны);	
	 // Заполнили Табличную часть на форме
	 НоваяСтрока = Объект.ДанныеФайла1.Добавить();
	 НоваяСтрока.Сыгран = Истина;  
	 НоваяСтрока.Дата = НашаДата;
	 НоваяСтрока.Турнир = "РФПЛ";  
	 НоваяСтрока.КомандаХозяев = СтрКомандаХозяев;
	 НоваяСтрока.Счет = Счет;  
	 НоваяСтрока.КомандаГостей = СтрКомандаГостей; 
	 НоваяСтрока.КтоИграл = СтрБезСчетаИДаты; 
	 НоваяСтрока.Сезон = Сезон;
	 НоваяСтрока.Тур = НомерТураПолный;	 
	 НоваяСтрока.ЗабилиХозяева = Лев(Счет,1);
	 НоваяСтрока.ЗабилиГости = Прав(Счет,1);  
	 
	 //Сообщить(Стр);  
	 // Читаем следующую строку
	 Стр = Текст.ПрочитатьСтроку();
 КонецЦикла;    
 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСезон1(Команда)
	ЗагрузитьСезон1НаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСезон1НаСервере()  
	
	Текст = Новый ЧтениеТекста("d:\Сезон 2020_2021.txt", КодировкаТекста.UTF8); 

Стр = Текст.ПрочитатьСтроку(); 
	
 // Прочитали 1 тур думаем как это грузить на форму
 Пока Стр <> Неопределено Цикл // строки читаются до символа перевода строки  

	 
// Получим номер тура строкой 

Если СтрДлина(Стр) = 5 Тогда
 НомерТура = Прав(Стр, 1);
 СтрокаБезНомерТура = СокрЛП(Лев(Стр, 4));
 НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
ИначеЕсли  СтрДлина(Стр) = 6 Тогда
 НомерТура = Прав(Стр, 2);
 СтрокаБезНомерТура = Лев(Стр, 3);
 НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
КонецЕсли;  
	 
// Убираем строчку где (Тур	Дата, время	Матч	Счет)	 
	 
	Если СтрНайти(Стр, "Тур") > 0 или СтрНайти(Стр, "Счет") > 0 Тогда 
		Стр = Текст.ПрочитатьСтроку(); 
		Продолжить;	
	КонецЕсли;
	// Убираем пробелы в строке слева и справа
	 Стр = СокрЛП(Стр); 
	 
	 // Получаем Дату
	 НашаДатаТекстНеправильный = Лев(Стр,10);  
	 Год = Прав(НашаДатаТекстНеправильный,4);
	 Месяц = Сред(НашаДатаТекстНеправильный,4,2);
	 День = Лев(НашаДатаТекстНеправильный,2);
	 НашаДатаСтрока = Год + Месяц + День;
	 НашаДата = Дата(НашаДатаСтрока);
	 //КомандаХозяев
	 СтрБезДаты = СокрЛП(Сред(Стр,11)); 
	 Счет = Прав(СтрБезДаты,3);
	 ЗнакТире = СтрНайти(СтрБезДаты, "–");	 
	 СтрКомандаХозяев = СокрЛП(Лев(СтрБезДаты, ЗнакТире-1)); 
	 
	  //КомандаГостей 
	 СтрБезСчетаИДаты = СокрЛП(Лев(СтрБезДаты,СтрДлина(СтрБезДаты)-3)); 
	 ЗнакТиреСправа = СтрНайти(СтрБезСчетаИДаты, "–",НаправлениеПоиска.СКонца);	 
	 СтрКомандаГостей = СокрЛП(Сред(СтрБезСчетаИДаты, ЗнакТире + 1)); 
     	 
	// Сезон строка
	 Сезон = СокрЛП(Объект.Сезоны);	
	 // Заполнили Табличную часть на форме
	 НоваяСтрока = Объект.ДанныеФайла1.Добавить();
	 НоваяСтрока.Сыгран = Истина;  
	 НоваяСтрока.Дата = НашаДата;
	 НоваяСтрока.Турнир = "РФПЛ";  
	 НоваяСтрока.КомандаХозяев = СтрКомандаХозяев;
	 НоваяСтрока.Счет = Счет;  
	 НоваяСтрока.КомандаГостей = СтрКомандаГостей; 
	 НоваяСтрока.КтоИграл = СтрБезСчетаИДаты; 
	 НоваяСтрока.Сезон = Сезон;
	 НоваяСтрока.Тур = НомерТураПолный;	 
	 НоваяСтрока.ЗабилиХозяева = Лев(Счет,1);
	 НоваяСтрока.ЗабилиГости = Прав(Счет,1);  
	 
	 //Сообщить(Стр);  
	 // Читаем следующую строку
	 Стр = Текст.ПрочитатьСтроку();
 КонецЦикла;   
 
КонецПроцедуры

&НаКлиенте
 Процедура ЗагрузитьСезон2(Команда)
	 ЗагрузитьСезон2НаСервере();
 КонецПроцедуры

&НаСервере
 Процедура ЗагрузитьСезон2НаСервере()
	Текст = Новый ЧтениеТекста("d:\Сезон 2021_2022.txt", КодировкаТекста.UTF8); 

Стр = Текст.ПрочитатьСтроку(); 
	
 // Прочитали 1 тур думаем как это грузить на форму
 Пока Стр <> Неопределено Цикл // строки читаются до символа перевода строки  

	 
// Получим номер тура строкой 

Если СтрДлина(Стр) = 5 Тогда
 НомерТура = Прав(Стр, 1);
 СтрокаБезНомерТура = СокрЛП(Лев(Стр, 4));
 НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
ИначеЕсли  СтрДлина(Стр) = 6 Тогда
 НомерТура = Прав(Стр, 2);
 СтрокаБезНомерТура = Лев(Стр, 3);
 НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
КонецЕсли;  
	 
// Убираем строчку где (Тур	Дата, время	Матч	Счет)	 
	 
	Если СтрНайти(Стр, "Тур") > 0 или СтрНайти(Стр, "Счет") > 0 Тогда 
		Стр = Текст.ПрочитатьСтроку(); 
		Продолжить;	
	КонецЕсли;
	// Убираем пробелы в строке слева и справа
	 Стр = СокрЛП(Стр); 
	 
	 // Получаем Дату
	 НашаДатаТекстНеправильный = Лев(Стр,10);  
	 Год = Прав(НашаДатаТекстНеправильный,4);
	 Месяц = Сред(НашаДатаТекстНеправильный,4,2);
	 День = Лев(НашаДатаТекстНеправильный,2);
	 НашаДатаСтрока = Год + Месяц + День;
	 НашаДата = Дата(НашаДатаСтрока);
	 //КомандаХозяев
	 СтрБезДаты = СокрЛП(Сред(Стр,11)); 
	 Счет = Прав(СтрБезДаты,3);
	 ЗнакТире = СтрНайти(СтрБезДаты, "–");	 
	 СтрКомандаХозяев = СокрЛП(Лев(СтрБезДаты, ЗнакТире-1)); 
	 
	  //КомандаГостей 
	 СтрБезСчетаИДаты = СокрЛП(Лев(СтрБезДаты,СтрДлина(СтрБезДаты)-3)); 
	 ЗнакТиреСправа = СтрНайти(СтрБезСчетаИДаты, "–",НаправлениеПоиска.СКонца);	 
	 СтрКомандаГостей = СокрЛП(Сред(СтрБезСчетаИДаты, ЗнакТире + 1)); 
     	 
	// Сезон строка
	 Сезон = СокрЛП(Объект.Сезоны);	
	 // Заполнили Табличную часть на форме
	 НоваяСтрока = Объект.ДанныеФайла1.Добавить();
	 НоваяСтрока.Сыгран = Истина;  
	 НоваяСтрока.Дата = НашаДата;
	 НоваяСтрока.Турнир = "РФПЛ";  
	 НоваяСтрока.КомандаХозяев = СтрКомандаХозяев;
	 НоваяСтрока.Счет = Счет;  
	 НоваяСтрока.КомандаГостей = СтрКомандаГостей; 
	 НоваяСтрока.КтоИграл = СтрБезСчетаИДаты; 
	 НоваяСтрока.Сезон = Сезон;
	 НоваяСтрока.Тур = НомерТураПолный;	 
	 НоваяСтрока.ЗабилиХозяева = Лев(Счет,1);
	 НоваяСтрока.ЗабилиГости = Прав(Счет,1);  
	 
	 //Сообщить(Стр);  
	 // Читаем следующую строку
	 Стр = Текст.ПрочитатьСтроку();
	 КонецЦикла;  
	 
 КонецПроцедуры

&НаКлиенте
 Процедура ЗагрузитьСезон3(Команда)
	 ЗагрузитьСезон3НаСервере();
 КонецПроцедуры

&НаСервере
 Процедура ЗагрузитьСезон3НаСервере()
	Текст = Новый ЧтениеТекста("d:\Сезон 2022_2023.txt", КодировкаТекста.UTF8); 

Стр = Текст.ПрочитатьСтроку(); 
	
 // Прочитали 1 тур думаем как это грузить на форму
 Пока Стр <> Неопределено Цикл // строки читаются до символа перевода строки  

	 
// Получим номер тура строкой 

Если СтрДлина(Стр) = 5 Тогда
 НомерТура = Прав(Стр, 1);
 СтрокаБезНомерТура = СокрЛП(Лев(Стр, 4));
 НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
ИначеЕсли  СтрДлина(Стр) = 6 Тогда
 НомерТура = Прав(Стр, 2);
 СтрокаБезНомерТура = Лев(Стр, 3);
 НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
КонецЕсли;  
	 
// Убираем строчку где (Тур	Дата, время	Матч	Счет)	 
	 
	Если СтрНайти(Стр, "Тур") > 0 или СтрНайти(Стр, "Счет") > 0 Тогда 
		Стр = Текст.ПрочитатьСтроку(); 
		Продолжить;	
	КонецЕсли;
	// Убираем пробелы в строке слева и справа
	 Стр = СокрЛП(Стр); 
	 
	 // Получаем Дату
	 НашаДатаТекстНеправильный = Лев(Стр,10);  
	 Год = Прав(НашаДатаТекстНеправильный,4);
	 Месяц = Сред(НашаДатаТекстНеправильный,4,2);
	 День = Лев(НашаДатаТекстНеправильный,2);
	 НашаДатаСтрока = Год + Месяц + День;
	 НашаДата = Дата(НашаДатаСтрока);
	 //КомандаХозяев
	 СтрБезДаты = СокрЛП(Сред(Стр,11)); 
	 Счет = Прав(СтрБезДаты,3);
	 ЗнакТире = СтрНайти(СтрБезДаты, "–");	 
	 СтрКомандаХозяев = СокрЛП(Лев(СтрБезДаты, ЗнакТире-1)); 
	 
	  //КомандаГостей 
	 СтрБезСчетаИДаты = СокрЛП(Лев(СтрБезДаты,СтрДлина(СтрБезДаты)-3)); 
	 ЗнакТиреСправа = СтрНайти(СтрБезСчетаИДаты, "–",НаправлениеПоиска.СКонца);	 
	 СтрКомандаГостей = СокрЛП(Сред(СтрБезСчетаИДаты, ЗнакТире + 1)); 
     	 
	// Сезон строка
	 Сезон = СокрЛП(Объект.Сезоны);	
	 // Заполнили Табличную часть на форме
	 НоваяСтрока = Объект.ДанныеФайла1.Добавить();
	 НоваяСтрока.Сыгран = Истина;  
	 НоваяСтрока.Дата = НашаДата;
	 НоваяСтрока.Турнир = "РФПЛ";  
	 НоваяСтрока.КомандаХозяев = СтрКомандаХозяев;
	 НоваяСтрока.Счет = Счет;  
	 НоваяСтрока.КомандаГостей = СтрКомандаГостей; 
	 НоваяСтрока.КтоИграл = СтрБезСчетаИДаты; 
	 НоваяСтрока.Сезон = Сезон;
	 НоваяСтрока.Тур = НомерТураПолный;	 
	 НоваяСтрока.ЗабилиХозяева = Лев(Счет,1);
	 НоваяСтрока.ЗабилиГости = Прав(Счет,1);  
	 
	 //Сообщить(Стр);  
	 // Читаем следующую строку
	 Стр = Текст.ПрочитатьСтроку();
	 КонецЦикла; 
	 
 КонецПроцедуры

&НаКлиенте
 Процедура ЗагрузитьСезон4(Команда)
	 ЗагрузитьСезон4НаСервере();
 КонецПроцедуры

&НаСервере
 Процедура ЗагрузитьСезон4НаСервере()
	 Текст = Новый ЧтениеТекста("d:\Сезон 2023_2024.txt", КодировкаТекста.UTF8); 

Стр = Текст.ПрочитатьСтроку(); 
	
 // Прочитали 1 тур думаем как это грузить на форму
 Пока Стр <> Неопределено Цикл // строки читаются до символа перевода строки  

	 
// Получим номер тура строкой 

Если СтрДлина(Стр) = 5 Тогда
 НомерТура = Прав(Стр, 1);
 СтрокаБезНомерТура = СокрЛП(Лев(Стр, 4));
 НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
ИначеЕсли  СтрДлина(Стр) = 6 Тогда
 НомерТура = Прав(Стр, 2);
 СтрокаБезНомерТура = Лев(Стр, 3);
 НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
КонецЕсли;  
	 
// Убираем строчку где (Тур	Дата, время	Матч	Счет)	 
	 
	Если СтрНайти(Стр, "Тур") > 0 или СтрНайти(Стр, "Счет") > 0 Тогда 
		Стр = Текст.ПрочитатьСтроку(); 
		Продолжить;	
	КонецЕсли;
	// Убираем пробелы в строке слева и справа
	 Стр = СокрЛП(Стр); 
	 
	 // Получаем Дату
	 НашаДатаТекстНеправильный = Лев(Стр,10);  
	 Год = Прав(НашаДатаТекстНеправильный,4);
	 Месяц = Сред(НашаДатаТекстНеправильный,4,2);
	 День = Лев(НашаДатаТекстНеправильный,2);
	 НашаДатаСтрока = Год + Месяц + День;
	 НашаДата = Дата(НашаДатаСтрока);
	 //КомандаХозяев
	 СтрБезДаты = СокрЛП(Сред(Стр,11)); 
	 Счет = Прав(СтрБезДаты,3);
	 ЗнакТире = СтрНайти(СтрБезДаты, "–");	 
	 СтрКомандаХозяев = СокрЛП(Лев(СтрБезДаты, ЗнакТире-1)); 
	 
	  //КомандаГостей 
	 СтрБезСчетаИДаты = СокрЛП(Лев(СтрБезДаты,СтрДлина(СтрБезДаты)-3)); 
	 ЗнакТиреСправа = СтрНайти(СтрБезСчетаИДаты, "–",НаправлениеПоиска.СКонца);	 
	 СтрКомандаГостей = СокрЛП(Сред(СтрБезСчетаИДаты, ЗнакТире + 1)); 
     	 
	// Сезон строка
	 Сезон = СокрЛП(Объект.Сезоны);	
	 // Заполнили Табличную часть на форме
	 НоваяСтрока = Объект.ДанныеФайла1.Добавить();
	 НоваяСтрока.Сыгран = Истина;  
	 НоваяСтрока.Дата = НашаДата;
	 НоваяСтрока.Турнир = "РФПЛ";  
	 НоваяСтрока.КомандаХозяев = СтрКомандаХозяев;
	 НоваяСтрока.Счет = Счет;  
	 НоваяСтрока.КомандаГостей = СтрКомандаГостей; 
	 НоваяСтрока.КтоИграл = СтрБезСчетаИДаты; 
	 НоваяСтрока.Сезон = Сезон;
	 НоваяСтрока.Тур = НомерТураПолный;	 
	 НоваяСтрока.ЗабилиХозяева = Лев(Счет,1);
	 НоваяСтрока.ЗабилиГости = Прав(Счет,1);  
	 
	 //Сообщить(Стр);  
	 // Читаем следующую строку
	 Стр = Текст.ПрочитатьСтроку();
 КонецЦикла;  
 
 
 КонецПроцедуры

&НаКлиенте
 Процедура ЗагрузитьСезон5(Команда)
	 ЗагрузитьСезон5НаСервере();
 КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСезон5НаСервере() 
	
	 Текст = Новый ЧтениеТекста("d:\Сезон 2024_2025.txt", КодировкаТекста.UTF8); 

Стр = Текст.ПрочитатьСтроку();  

 // Прочитали 1 тур думаем как это грузить на форму
 Пока Стр <> Неопределено Цикл // строки читаются до символа перевода строки   

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	 
	Стр = СокрЛП(Стр); 
		
		СтрДлиннна = СтрДлина(Стр); 
		
		НольВСтроке = СтрНайти(Стр,"0", НаправлениеПоиска.СКонца,,1);
		//Сообщить("Прочитатана строка: " + Стр + " знак в строке: " + НольВСтроке + ", Длина всей строки: " + СтрДлиннна); 
		
		// Условие когда 0 в конце строки. то есть последний символ в строке, убираем его из строки
		Если (СтрДлиннна - НольВСтроке) = 0 Тогда 
			КолСимволов = СтрДлиннна - 1;
			Стр = Сред(Стр,1,КолСимволов);  
			//Сообщить(Стр);
		КонецЕсли;
		
		
		// Условие когда 0 второй с конца строки. то есть предпоследний символ в строке
		Если (СтрДлиннна - НольВСтроке) = 1 Тогда 
			//КолСимволовДоДвоеточияПлюяОДин = СтрДлиннна - 1;
			СтрДоДвоеточия = Сред(Стр,1,НольВСтроке-1); 
			СтрОдинЗнакВконце = Прав(Стр, 1);
			Стр = СтрДоДвоеточия + СтрОдинЗнакВконце; 
			//Сообщить(Стр);  
		КонецЕсли;
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	 
// Получим номер тура строкой 

Если СтрДлина(Стр) = 5 Тогда
 НомерТура = Прав(Стр, 1);
 СтрокаБезНомерТура = СокрЛП(Лев(Стр, 4));
 НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
ИначеЕсли  СтрДлина(Стр) = 6 Тогда
 НомерТура = Прав(Стр, 2);
 СтрокаБезНомерТура = Лев(Стр, 3);
 НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
КонецЕсли;  
	 
// Убираем строчку где (Тур	Дата, время	Матч	Счет)	 
	 
	Если СтрНайти(Стр, "Тур") > 0 или СтрНайти(Стр, "Счет") > 0 Тогда 
		Стр = Текст.ПрочитатьСтроку(); 
		Продолжить;	
	КонецЕсли;
	// Убираем пробелы в строке слева и справа
	 Стр = СокрЛП(Стр); 
	 
	 // Получаем Дату
	 НашаДатаТекстНеправильный = Лев(Стр,10);  
	 Год = Прав(НашаДатаТекстНеправильный,4);
	 Месяц = Сред(НашаДатаТекстНеправильный,4,2);
	 День = Лев(НашаДатаТекстНеправильный,2);
	 НашаДатаСтрока = Год + Месяц + День;
	 НашаДата = Дата(НашаДатаСтрока);
	 //КомандаХозяев
	 СтрБезДаты = СокрЛП(Сред(Стр,11)); 
	 Счет = Прав(СтрБезДаты,3);
	 ЗнакТире = СтрНайти(СтрБезДаты, "–");	 
	 СтрКомандаХозяев = СокрЛП(Лев(СтрБезДаты, ЗнакТире-1)); 
	 
	  //КомандаГостей 
	 СтрБезСчетаИДаты = СокрЛП(Лев(СтрБезДаты,СтрДлина(СтрБезДаты)-3)); 
	 ЗнакТиреСправа = СтрНайти(СтрБезСчетаИДаты, "–",НаправлениеПоиска.СКонца);	 
	 СтрКомандаГостей = СокрЛП(Сред(СтрБезСчетаИДаты, ЗнакТире + 1)); 
     	 
	// Сезон строка
	 Сезон = СокрЛП(Объект.Сезоны);	
	 // Заполнили Табличную часть на форме
	 НоваяСтрока = Объект.ДанныеФайла1.Добавить();
	 НоваяСтрока.Сыгран = Истина;  
	 НоваяСтрока.Дата = НашаДата;
	 НоваяСтрока.Турнир = "РФПЛ";  
	 НоваяСтрока.КомандаХозяев = СтрКомандаХозяев;
	 НоваяСтрока.Счет = Счет;  
	 НоваяСтрока.КомандаГостей = СтрКомандаГостей; 
	 НоваяСтрока.КтоИграл = СтрБезСчетаИДаты; 
	 НоваяСтрока.Сезон = Сезон;
	 НоваяСтрока.Тур = НомерТураПолный;	 
	 НоваяСтрока.ЗабилиХозяева = Лев(Счет,1);
	 НоваяСтрока.ЗабилиГости = Прав(Счет,1);  
	 
	 //Сообщить(Стр);  
	 // Читаем следующую строку
	 Стр = Текст.ПрочитатьСтроку();
 КонецЦикла;  
 
 
 КонецПроцедуры

&НаКлиенте
 Процедура УдалитьНолиикСезон24_25(Команда)
	 //УдалитьНолиикСезон24_25НаСервере();   
	 
	 Текст = Новый ЧтениеТекста("d:\Сезон 2024_2025.txt", КодировкаТекста.UTF8); 

	Стр = Текст.ПрочитатьСтроку(); 

	
	Пока Стр <> Неопределено Цикл // строки читаются до символа перевода строки 
		
		Стр = СокрЛП(Стр); 
		
		СтрДлиннна = СтрДлина(Стр); 
		
		НольВСтроке = СтрНайти(Стр,"0", НаправлениеПоиска.СКонца,,1);
		//Сообщить("Прочитатана строка: " + Стр + " знак в строке: " + НольВСтроке + ", Длина всей строки: " + СтрДлиннна); 
		
		// Условие когда 0 в конце строки. то есть последний символ в строке, убираем его из строки
		Если (СтрДлиннна - НольВСтроке) = 0 Тогда 
			КолСимволов = СтрДлиннна - 1;
			Стр = Сред(Стр,1,КолСимволов);  
			Сообщить(Стр);
		КонецЕсли;
		
		
		// Условие когда 0 второй с конца строки. то есть предпоследний символ в строке
		Если (СтрДлиннна - НольВСтроке) = 1 Тогда 
			//КолСимволовДоДвоеточияПлюяОДин = СтрДлиннна - 1;
			СтрДоДвоеточия = Сред(Стр,1,НольВСтроке-1); 
			СтрОдинЗнакВконце = Прав(Стр, 1);
			Стр = СтрДоДвоеточия + СтрОдинЗнакВконце; 
			Сообщить(Стр);  
		КонецЕсли;


Стр = Текст.ПрочитатьСтроку(); 


КонецЦикла; 

	
	//Стр = ТекстБезНолик.ПрочитатьСтроку(); 
	 
КонецПроцедуры  



&НаСервере
Процедура УдалитьНолиикСезон24_25НаСервере()   
	
//	 Текст = Новый ЧтениеТекста("d:\Сезон 2024_2025.txt", КодировкаТекста.UTF8); 
//	  
//	//ТекстБезНолик = УдалитьНолик(Текст);
//  

//Стр = ТекстБезНолик.ПрочитатьСтроку();   


//	
// // Прочитали 1 тур думаем как это грузить на форму
// Пока Стр <> Неопределено Цикл // строки читаются до символа перевода строки  

//	 
//// Получим номер тура строкой 

//Если СтрДлина(Стр) = 5 Тогда
// НомерТура = Прав(Стр, 1);
// СтрокаБезНомерТура = СокрЛП(Лев(Стр, 4));
// НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
//ИначеЕсли  СтрДлина(Стр) = 6 Тогда
// НомерТура = Прав(Стр, 2);
// СтрокаБезНомерТура = Лев(Стр, 3);
// НомерТураПолный = НомерТура + " " + СтрокаБезНомерТура;
//КонецЕсли;  
//	 
//// Убираем строчку где (Тур	Дата, время	Матч	Счет)	 
//	 
//	Если СтрНайти(Стр, "Тур") > 0 или СтрНайти(Стр, "Счет") > 0 Тогда 
//		Стр = ТекстБезНолик.ПрочитатьСтроку(); 
//		Продолжить;	
//	КонецЕсли;
//	// Убираем пробелы в строке слева и справа
//	 Стр = СокрЛП(Стр); 
//	 
//	 // Получаем Дату
//	 НашаДатаТекстНеправильный = Лев(Стр,10);  
//	 Год = Прав(НашаДатаТекстНеправильный,4);
//	 Месяц = Сред(НашаДатаТекстНеправильный,4,2);
//	 День = Лев(НашаДатаТекстНеправильный,2);
//	 НашаДатаСтрока = Год + Месяц + День;
//	 НашаДата = Дата(НашаДатаСтрока);
//	 //КомандаХозяев
//	 СтрБезДаты = СокрЛП(Сред(Стр,11)); 
//	 Счет = Прав(СтрБезДаты,3);
//	 ЗнакТире = СтрНайти(СтрБезДаты, "–");	 
//	 СтрКомандаХозяев = СокрЛП(Лев(СтрБезДаты, ЗнакТире-1)); 
//	 
//	  //КомандаГостей 
//	 СтрБезСчетаИДаты = СокрЛП(Лев(СтрБезДаты,СтрДлина(СтрБезДаты)-3)); 
//	 ЗнакТиреСправа = СтрНайти(СтрБезСчетаИДаты, "–",НаправлениеПоиска.СКонца);	 
//	 СтрКомандаГостей = СокрЛП(Сред(СтрБезСчетаИДаты, ЗнакТире + 1)); 
//     	 
//	// Сезон строка
//	 Сезон = СокрЛП(Объект.Сезоны);	
//	 // Заполнили Табличную часть на форме
//	 НоваяСтрока = Объект.ДанныеФайла1.Добавить();
//	 НоваяСтрока.Сыгран = Истина;  
//	 НоваяСтрока.Дата = НашаДата;
//	 НоваяСтрока.Турнир = "РФПЛ";  
//	 НоваяСтрока.КомандаХозяев = СтрКомандаХозяев;
//	 НоваяСтрока.Счет = Счет;  
//	 НоваяСтрока.КомандаГостей = СтрКомандаГостей; 
//	 НоваяСтрока.КтоИграл = СтрБезСчетаИДаты; 
//	 НоваяСтрока.Сезон = Сезон;
//	 НоваяСтрока.Тур = НомерТураПолный;	 
//	 НоваяСтрока.ЗабилиХозяева = Лев(Счет,1);
//	 НоваяСтрока.ЗабилиГости = Прав(Счет,1);  
//	 
//	 //Сообщить(Стр);  
//	 // Читаем следующую строку
//	 Стр = ТекстБезНолик.ПрочитатьСтроку();
// КонецЦикла;     
// 
 
КонецПроцедуры      


//Строка = "20.07.2024	Крылья Советов – Зенит	0:04";
//Позиция = 1;
//НайденоВхождений = 0;

//Пока Истина Цикл
//    Позиция = Найти(Строка, "0", Позиция);
//    
//    Если Позиция = 0 Тогда
//        Прервать;
//    КонецЕсли;
//    
//    Сообщить("Символ '0' найден на позиции: " + Позиция);
//    НайденоВхождений = НайденоВхождений + 1;
//    Позиция = Позиция + 1;
//КонецЦикла;

//Если НайденоВхождений = 0 Тогда
//    Сообщить("Символ '0' не найден в строке");
//Иначе
//    Сообщить("Всего найдено вхождений: " + НайденоВхождений);
//КонецЕсли;

 
 
// Функция УдалитьНолик(Текст)
//	 
//Стр = Текст.ПрочитатьСтроку();    

//Пока Стр <> Неопределено Цикл // строки читаются до символа перевода строки  
//Сообщить("Прочитатана строка");
//	
//КонецЦикла; 
//	

//КонецФункции // ()
// 
 
 
 
 
 
 
#КонецОбласти





#Область ОбработчикиСобытий
//Функция СтрокаЗадомНаперед(Знач Строка)
//    Результат = "";
//    ДлинаСтроки = СтрДлина(Строка);
//    Для Счетчик = 0 По ДлинаСтроки - 1 Цикл
//        Индекс = ДлинаСтроки - Счетчик;
//        Символ = Сред(Строка, Индекс, 1);
//        Результат = Результат + Символ;
//    КонецЦикла;
//    Возврат Результат;
//КонецФункции   



//&НаКлиенте
//Процедура ПрочитатьФайл_TXT()       	
//	
//	Объект.ДанныеФайла.Очистить();
//	
//	СпособЧтения = "ЧтениеТекста";//"ТекстовыйДокумент";
//	Если СпособЧтения = "ТекстовыйДокумент" Тогда
//		
//		Текст = Новый ТекстовыйДокумент;
//		Текст.Прочитать(Объект.ПутьКФайлу);
//		КоличествоСтрок = Текст.КоличествоСтрок();
//		
//		Для НомерСтроки=1 По КоличествоСтрок Цикл
//			
//			ТекСтрока = Текст.ПолучитьСтроку(НомерСтроки);
//			ЧастиСтроки = СтрРазделить(ТекСтрока, ";");
//			
//			Если ЧастиСтроки.Количество() < 3 Тогда
//				Сообщение = Новый СообщениеПользователю;
//				Сообщение.Текст = "В строке № " + НомерСтроки + " неверный формат";
//				Сообщение.Сообщить();
//				Продолжить;
//			КонецЕсли;
//			
//			НоваяСтрока = Объект.ДанныеФайла.Добавить();
//			НоваяСтрока.Наименование = ЧастиСтроки[0];
//			НоваяСтрока.НаименованиеПолное = ЧастиСтроки[1];
//			НоваяСтрока.УНП = ЧастиСтроки[2];
//			
//		КонецЦикла;
//		
//	Иначе
//		
//		Текст = Новый ЧтениеТекста;
//		Текст.Открыть(Объект.ПутьКФайлу);
//		
//		ТекСтрока = Текст.ПрочитатьСтроку();
//		
//		НомерСтроки = 1;
//		
//		Пока ТекСтрока <> Неопределено Цикл
//			
//			ЧастиСтроки = СтрРазделить(ТекСтрока, ";");
//			
//			Если ЧастиСтроки.Количество() < 3 Тогда
//				Сообщение = Новый СообщениеПользователю;
//				Сообщение.Текст = "В строке № " + НомерСтроки + " неверный формат";
//				Сообщение.Сообщить();
//				Продолжить;
//			КонецЕсли;
//			
//			НоваяСтрока = Объект.ДанныеФайла.Добавить();
//			НоваяСтрока.Наименование = ЧастиСтроки[0];
//			НоваяСтрока.НаименованиеПолное = ЧастиСтроки[1];
//			НоваяСтрока.УНП = ЧастиСтроки[2];
//			
//			ТекСтрока = Текст.ПрочитатьСтроку();  
//			НомерСтроки = НомерСтроки + 1;
//		
//		КонецЦикла;
//		
//		
//	КонецЕсли;
//	
//КонецПроцедуры








#КонецОбласти


#Область ОбработчикиСобытий

//  &НаСервере
//Процедура СоздатьПровестиДокументыНаСервере()  
//	
//	//Организация - "Электроник ООО"
//	//Склад - "Основной"
//	//Контрагент - "Прокси Торг ООО"
//	//договор - "00020";
//	//Номенклатура "Робот-пылесос Redmond RV-R650S WiFi"  
//	
//   // Создаем Новый Тур - документ
//	
//	НовыйТур = Документы.Тур.СоздатьДокумент();    
//	
//	//реквизиты шапки  
//	//ТЗ_Дата = Объект.ДанныеФайла1.ВыгрузитьКолонку("Дата");   
//	
//	 //а=5;
//	//ДанныеФайла1.
//	//НовыйТур.Дата = ТекущаяДата();
//	
//	////реквизиты шапки 
//	
//	
//	НовыйТур.Сезон = Константы.ТекущийСезон.Получить();	
//	
//	//Если  Справочники.Сезоны.НайтиПоНаименованию("Сезон 2024/2025 Премьер-лига") <> 0 или Справочники.Сезоны.НайтиПоНаименованию("Сезон 2024/2025 Премьер-лига") <>  Неопределено Тогда
//	//	Объект.Сезоны.Ссылка = Справочники.Организации.НайтиПоНаименованию(СтрокаТур.Хозяин);	  
//	//ИначеЕсли 
//	//	Справочники.Сезоны.НайтиПоНаименованию("Сезон 2024/2025 Премьер-лига") = 0 или Справочники.Сезоны.НайтиПоНаименованию("Сезон 2024/2025 Премьер-лига") =  Неопределено Тогда
//	//    Сообщить("Нет снзона");
//	//КонецЕсли; 
//	//
//	//НовыйТур.Организация = Справочники.Организации.НайтиПоНаименованию("Электроник ООО");
//	//НовыйТур.Склад = Справочники.Склады.НайтиПоНаименованию("Основной");
//	//НовыйТур.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("Прокси Торг ООО");
//	//НовыйТур.Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("00020");
//	//
//	//табличная часть
//	
//	
//	
//	
//	//СтрокаТовары = НовыйТур.Игры.Добавить();
//	//СтрокаТовары.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию("Робот-пылесос Redmond RV-R650S WiFi");
//	//СтрокаТовары.Количество = 3;
//	//СтрокаТовары.Цена = 1000;
//	//
//	//ИменаРеквизитов = "ЕдиницаИзмерения,СтавкаНДС";	
//	//РеквизитыНоменклатуры = ОбщегоНазначенияВызовСервера.ПолучитьРеквизитыНоменклатуры(СтрокаТовары.Номенклатура, ИменаРеквизитов);

//	//СтрокаТовары.ЕдиницаИзмерения = РеквизитыНоменклатуры.ЕдиницаИзмерения;
//	//СтрокаТовары.СтавкаНДС = РеквизитыНоменклатуры.СтавкаНДС;
//	//
//	//ОбработкаТабличнхЧастейСервер.РассчитатьСуммыВСтрокеТабличнойЧасти(СтрокаТовары);           	
//	
//	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//	
//	Для каждого СтрокаТЧ Из Объект.ДанныеФайла1 Цикл   
//		
//	СтрокаТур = НовыйТур.Игры.Добавить();
//	
//		//реквизиты шапки
//	СтрокаТур.Дата = СтрокаТЧ.Дата;    
//	
//	//Если  Справочники.Команды.НайтиПоНаименованию(СтрокаТЧ.Хозяин) <> 0 или Справочники.Команды.НайтиПоНаименованию(СтрокаТЧ.Хозяин)  <>  Неопределено Тогда  
//	  КомандаХозяинПоиска =  СтрокаТЧ.КомандаХозяев;
//	  СтрокаТур.Хозяин = Справочники.Команды.НайтиПоНаименованию(КомандаХозяинПоиска);	
//  //КонецЕсли;         
//  
//  
//  //Если  Справочники.Команды.НайтиПоНаименованию(СтрокаТЧ.Гость) <> 0 или Справочники.Команды.НайтиПоНаименованию(СтрокаТЧ.Гость)  <>  Неопределено Тогда
//     КомандаХозяинПоиска =  СтрокаТЧ.КомандаГостей;   
//	 СтрокаТур.Гость = Справочники.Команды.НайтиПоНаименованию(КомандаХозяинПоиска);	
//	//КонецЕсли;

//		
//	//СтрокаТур.Гость = СтрокаТЧ.Дата;  
//	СтрокаТур.Счет = СтрокаТЧ.Счет; 
//	СтрокаТур.МП = СтрокаТЧ.ЗабилиГости; 
//	СтрокаТур.МЗ = СтрокаТЧ.ЗабилиХозяева; 
//	СтрокаТур.Сыгран = Истина; 
//	
//	СыграноИгр = НовыйТур.Игры.Количество(); 
//	
//	// Дата 
//	Если  НовыйТур.Дата = '00010101000000' Тогда
//		// Дата равна нулевой (01.01.0001)  
//		НовыйТур.Дата = СтрокаТур.Дата; 
//	//Иначе
//	//	// Дата не нулевая 		
//	КонецЕсли;
//	
//		
//	
//	
//	//СтрокаТур.Сыгран = СтрокаТЧ.Сыгран;  
//	//СтрокаТур.МЗ = 1;
//	//СтрокаТур.МП = 1;
//		
//	 	   //   Если СтрокаТЧ.КомандаГостей = "Динамо2" Тогда
//	   //    СтрокаТЧ.КомандаГостей = "Динамо Махачкала";			
//	   //КонецЕсли; 

//	   
//	   
//		////СтрокаФайла = СтрокаТЧ.Наименование + ";" + СтрокаТЧ.НаименованиеПолное + ";" + СтрокаТЧ.УНП;
//		//Сообщить("Хозяева:  " + СтрокаТЧ.КомандаХозяев + " Гости: " + СтрокаТЧ.КомандаГостей);
//		
//		
//	КонецЦикла; 

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
//	//НовыйТур.Записать(); 
//	//Сообщить("Создан документ: " + НовыйТур.Номер + "  " + НовыйТур.Дата);	
//	
//	
//	// Вставить содержимое обработчика.
//КонецПроцедуры


#КонецОбласти


