
Процедура Печать() Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ_СПИСОК(Печать)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	ТабДок = Новый ТабличныйДокумент;
	Макет = Справочники.Команды.ПолучитьМакет("Печать");
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(Область);
	// Шапка
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Область);
	Выборка = Справочники.Команды.Выбрать();
	Пока Выборка.Следующий() = Истина Цикл
		Объект = Выборка.ПолучитьОбъект();
		Область = Макет.ПолучитьОбласть("Элемент");
		ТабДок.Вывести(Область);
	КонецЦикла;

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}_КОНСТРУКТОР_ПЕЧАТИ_СПИСОК
КонецПроцедуры

