Перем _В, _Н, _П, _О, _ПО;

Процедура ОбнулитьРеквизиты()
	_В = 0; _Н = 0; _П = 0; _О = 0; _ПО = 0;
КонецПроцедуры  

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Игры.Записывать = Истина;
	
	СыграноИгр = 0;
	
	ТекГод = Год(Дата);       
	
	//Сезон = Справочники.Сезоны.НайтиПоКоду(Формат(ТекГод, "ЧГ=")); 
	
	// Саша комментарий начало дата от 20.06.2025 9:43:19
	// пока закоментим сами будем заполнять Сезон
	
	//	Сезон = Константы.ТекущийСезон.Получить();   	
	// Саша комментарий конец дата от 20.06.2025 9:43:19       
	
	//Очки как получают
	
	Если ТекГод < 1995 Тогда
		ОчковЗаПобеду = 2;
		ПотерОчковЗаНичью = 1
	Иначе	
		ОчковЗаПобеду = 3;
		ПотерОчковЗаНичью = 2
	КонецЕсли;     
	
	//Очки как получают
	
	
	Для Каждого ТекСтрокаИгры Из Игры Цикл
		
		// регистр Игры Приход
		Для йй = 1 По 2 Цикл
			
			Движ = Движения.Игры.Добавить();
			
			Движ.Период	= Дата; //1 Тут надо дату сезона ставить будет
			Движ.Сезон	= Сезон; // 2
			//Движ.Страна	= Константы.ТекущаяСтрана.Получить();
			Движ.Дата	= ТекСтрокаИгры.Дата; // 3
			Движ.Тур		= Число(Номер);   // 4
			
			К1			= ТекСтрокаИгры.Хозяин; // 5
			К2			= ТекСтрокаИгры.Гость;  // 6
			
			Если йй=2 Тогда Врм = К1; К1 = К2; К2 = Врм; 
				
			КонецЕсли;
			
			Движ.Кто		= К1;
			Движ.СКем	    = К2;
			Движ.ГдеИгра    = йй;
			
			Если ТекСтрокаИгры.Сыгран Тогда // будут и цифры
				МЗ = ТекСтрокаИгры.МЗ;
				МП = ТекСтрокаИгры.МП;
				
				Если йй=2 Тогда Врм = МЗ; МЗ = МП; МП = Врм; 
					
				КонецЕсли;
				
				Движ.МЗ = МЗ; Движ.МП = МП;
				
				ОбнулитьРеквизиты();
				Если МЗ > МП Тогда
					_В = 1; _О = ОчковЗаПобеду;
				ИначеЕсли МЗ=МП	Тогда
					_Н = 1; _О = 1; _ПО = ПотерОчковЗаНичью;
				Иначе
					_П = 1; _ПО = ОчковЗаПобеду;
				КонецЕсли;
				
				Движ.Выигр = _В;
				Движ.Ничьи = _Н;
				Движ.Пораж = _П;
				
				Движ.МЗ = МЗ; Движ.МП = МП;
				
				Движ.Очки = _О;
				Движ.ПОчки = _ПО;
				
				Если МЗ=0 И МП=0 Тогда
					Движ.Счет = 99 
				Иначе
					Движ.Счет = МЗ*10+МП	
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		// подсчет количества сыгранных игр
		СыграноИгр = СыграноИгр + ?(ТекСтрокаИгры.Сыгран, 1, 0);
		
	КонецЦикла;
	
	ЭтотОбъект.Записать();	// либо подсч. кол-во игр в форме документа
	
КонецПроцедуры


//Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//	
//	Движения.Игры.Записывать = Истина;
//	
//	СыграноИгр = 0;
//	
//	ТекГод = Год(Дата);       
//	
//	//Сезон = Справочники.Сезоны.НайтиПоКоду(Формат(ТекГод, "ЧГ=")); 
//	
//	// Саша комментарий начало дата от 20.06.2025 9:43:19
//	// пока закоментим сами будем заполнять Сезон
//	
//	//	Сезон = Константы.ТекущийСезон.Получить();   	
//	// Саша комментарий конец дата от 20.06.2025 9:43:19       
//	
//	//Очки как получают
//	
//	Если ТекГод < 1995 Тогда
//		ОчковЗаПобеду = 2;
//		ПотерОчковЗаНичью = 1
//	Иначе	
//		ОчковЗаПобеду = 3;
//		ПотерОчковЗаНичью = 2
//	КонецЕсли;     
//	
//	//Очки как получают
//	
//	
//	Для Каждого ТекСтрокаИгры Из Игры Цикл
//		
//		// регистр Игры Приход
//		Для йй = 1 По 2 Цикл
//			
//			Движ = Движения.Игры.Добавить();
//			
//			Движ.Период	= Дата; //1 Тут надо дату сезона ставить будет
//			Движ.Сезон	= Сезон; // 2
//			//Движ.Страна	= Константы.ТекущаяСтрана.Получить();
//			Движ.Дата	= ТекСтрокаИгры.Дата; // 3
//			Движ.Тур		= Число(Номер);   // 4
//			
//			К1			= ТекСтрокаИгры.Хозяин; // 5
//			К2			= ТекСтрокаИгры.Гость;  // 6
//			
//			Если йй=2 Тогда Врм = К1; К1 = К2; К2 = Врм; 
//				
//			КонецЕсли;
//			
//			Движ.Кто		= К1;
//			Движ.СКем	    = К2;
//			Движ.ГдеИгра    = йй;
//			
//			Если ТекСтрокаИгры.Сыгран Тогда // будут и цифры
//				МЗ = ТекСтрокаИгры.МЗ;
//				МП = ТекСтрокаИгры.МП;
//				
//				Если йй=2 Тогда Врм = МЗ; МЗ = МП; МП = Врм; 
//					
//				КонецЕсли;
//				
//				Движ.МЗ = МЗ; Движ.МП = МП;
//				
//				ОбнулитьРеквизиты();
//				Если МЗ > МП Тогда
//					_В = 1; _О = ОчковЗаПобеду;
//				ИначеЕсли МЗ=МП	Тогда
//					_Н = 1; _О = 1; _ПО = ПотерОчковЗаНичью;
//				Иначе
//					_П = 1; _ПО = ОчковЗаПобеду;
//				КонецЕсли;
//				
//				Движ.Выигр = _В;
//				Движ.Ничьи = _Н;
//				Движ.Пораж = _П;
//				
//				Движ.МЗ = МЗ; Движ.МП = МП;
//				
//				Движ.Очки = _О;
//				Движ.ПОчки = _ПО;
//				
//				Если МЗ=0 И МП=0 Тогда
//					Движ.Счет = 99 
//				Иначе
//					Движ.Счет = МЗ*10+МП	
//				КонецЕсли;
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//		// подсчет количества сыгранных игр
//		СыграноИгр = СыграноИгр + ?(ТекСтрокаИгры.Сыгран, 1, 0);
//		
//	КонецЦикла;
//	
//	ЭтотОбъект.Записать();	// либо подсч. кол-во игр в форме документа
//	
//КонецПроцедуры
